/* automatically generated by rust-bindgen 0.60.1 */

pub const __DARWIN_ONLY_64_BIT_INO_T: u32 = 0;
pub const __DARWIN_ONLY_UNIX_CONFORMANCE: u32 = 1;
pub const __DARWIN_ONLY_VERS_1050: u32 = 0;
pub const __DARWIN_UNIX03: u32 = 1;
pub const __DARWIN_64_BIT_INO_T: u32 = 1;
pub const __DARWIN_VERS_1050: u32 = 1;
pub const __DARWIN_NON_CANCELABLE: u32 = 0;
pub const __DARWIN_SUF_64_BIT_INO_T: &[u8; 9usize] = b"$INODE64\0";
pub const __DARWIN_SUF_1050: &[u8; 6usize] = b"$1050\0";
pub const __DARWIN_SUF_EXTSN: &[u8; 14usize] = b"$DARWIN_EXTSN\0";
pub const __DARWIN_C_ANSI: u32 = 4096;
pub const __DARWIN_C_FULL: u32 = 900000;
pub const __DARWIN_C_LEVEL: u32 = 900000;
pub const __STDC_WANT_LIB_EXT1__: u32 = 1;
pub const __DARWIN_NO_LONG_LONG: u32 = 0;
pub const _DARWIN_FEATURE_64_BIT_INODE: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_UNIX_CONFORMANCE: u32 = 1;
pub const _DARWIN_FEATURE_UNIX_CONFORMANCE: u32 = 3;
pub const __API_TO_BE_DEPRECATED: u32 = 100000;
pub const __MAC_10_0: u32 = 1000;
pub const __MAC_10_1: u32 = 1010;
pub const __MAC_10_2: u32 = 1020;
pub const __MAC_10_3: u32 = 1030;
pub const __MAC_10_4: u32 = 1040;
pub const __MAC_10_5: u32 = 1050;
pub const __MAC_10_6: u32 = 1060;
pub const __MAC_10_7: u32 = 1070;
pub const __MAC_10_8: u32 = 1080;
pub const __MAC_10_9: u32 = 1090;
pub const __MAC_10_10: u32 = 101000;
pub const __MAC_10_10_2: u32 = 101002;
pub const __MAC_10_10_3: u32 = 101003;
pub const __MAC_10_11: u32 = 101100;
pub const __MAC_10_11_2: u32 = 101102;

pub const __SMOD: u32 = 8192;
pub const __SALC: u32 = 16384;
pub const __SIGN: u32 = 32768;
pub const _IOFBF: u32 = 0;
pub const _IOLBF: u32 = 1;
pub const _IONBF: u32 = 2;
pub const BUFSIZ: u32 = 1024;
pub const EOF: i32 = -1;
pub const FOPEN_MAX: u32 = 20;
pub const FILENAME_MAX: u32 = 1024;
pub const P_tmpdir: &[u8; 10usize] = b"/var/tmp/\0";
pub const L_tmpnam: u32 = 1024;
pub const TMP_MAX: u32 = 308915776;
pub const SEEK_SET: u32 = 0;
pub const SEEK_CUR: u32 = 1;
pub const SEEK_END: u32 = 2;
pub const L_ctermid: u32 = 1024;
pub const _USE_FORTIFY_LEVEL: u32 = 2;
pub const MQTT_INVALID_PROPERTY_ID: i32 = -2;
pub const MQTTCLIENT_PERSISTENCE_DEFAULT: u32 = 0;
pub const MQTTCLIENT_PERSISTENCE_NONE: u32 = 1;
pub const MQTTCLIENT_PERSISTENCE_USER: u32 = 2;
pub const MQTTCLIENT_PERSISTENCE_ERROR: i32 = -2;
pub const MQTTASYNC_SUCCESS: u32 = 0;
pub const MQTTASYNC_FAILURE: i32 = -1;
pub const MQTTASYNC_PERSISTENCE_ERROR: i32 = -2;
pub const MQTTASYNC_DISCONNECTED: i32 = -3;
pub const MQTTASYNC_MAX_MESSAGES_INFLIGHT: i32 = -4;
pub const MQTTASYNC_BAD_UTF8_STRING: i32 = -5;
pub const MQTTASYNC_NULL_PARAMETER: i32 = -6;
pub const MQTTASYNC_TOPICNAME_TRUNCATED: i32 = -7;
pub const MQTTASYNC_BAD_STRUCTURE: i32 = -8;
pub const MQTTASYNC_BAD_QOS: i32 = -9;
pub const MQTTASYNC_NO_MORE_MSGIDS: i32 = -10;
pub const MQTTASYNC_OPERATION_INCOMPLETE: i32 = -11;
pub const MQTTASYNC_MAX_BUFFERED_MESSAGES: i32 = -12;
pub const MQTTASYNC_SSL_NOT_SUPPORTED: i32 = -13;
pub const MQTTASYNC_BAD_PROTOCOL: i32 = -14;
pub const MQTTASYNC_BAD_MQTT_OPTION: i32 = -15;
pub const MQTTASYNC_WRONG_MQTT_VERSION: i32 = -16;
pub const MQTTASYNC_0_LEN_WILL_TOPIC: i32 = -17;
pub const MQTTASYNC_COMMAND_IGNORED: i32 = -18;
pub const MQTTASYNC_MAX_BUFFERED: i32 = -19;
pub const MQTTVERSION_DEFAULT: u32 = 0;
pub const MQTTVERSION_3_1: u32 = 3;
pub const MQTTVERSION_3_1_1: u32 = 4;
pub const MQTTVERSION_5: u32 = 5;
pub const MQTT_BAD_SUBSCRIBE: u32 = 128;
pub const MQTT_SSL_VERSION_DEFAULT: u32 = 0;
pub const MQTT_SSL_VERSION_TLS_1_0: u32 = 1;
pub const MQTT_SSL_VERSION_TLS_1_1: u32 = 2;
pub const MQTT_SSL_VERSION_TLS_1_2: u32 = 3;
pub const MQTTASYNC_TRUE: u32 = 1;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __uint64_t = ::std::os::raw::c_ulonglong;
pub type __darwin_intptr_t = ::std::os::raw::c_long;
pub type __darwin_natural_t = ::std::os::raw::c_uint;
pub type __darwin_ct_rune_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t {
    pub __mbstate8: [::std::os::raw::c_char; 128usize],
    pub _mbstateL: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        128usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    fn test_field___mbstate8() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__mbstate_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__mbstate8) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__mbstate_t),
                "::",
                stringify!(__mbstate8)
            )
        );
    }
    test_field___mbstate8();
    fn test_field__mbstateL() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__mbstate_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._mbstateL) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__mbstate_t),
                "::",
                stringify!(_mbstateL)
            )
        );
    }
    test_field__mbstateL();
}
pub type __darwin_mbstate_t = __mbstate_t;
pub type __darwin_ptrdiff_t = ::std::os::raw::c_long;
pub type __darwin_size_t = ::std::os::raw::c_ulong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_wchar_t = ::std::os::raw::c_int;
pub type __darwin_rune_t = __darwin_wchar_t;
pub type __darwin_wint_t = ::std::os::raw::c_int;
pub type __darwin_clock_t = ::std::os::raw::c_ulong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_ssize_t = ::std::os::raw::c_long;
pub type __darwin_time_t = ::std::os::raw::c_long;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_fsblkcnt_t = ::std::os::raw::c_uint;
pub type __darwin_fsfilcnt_t = ::std::os::raw::c_uint;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_id_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_ino_t = __darwin_ino64_t;
pub type __darwin_mach_port_name_t = __darwin_natural_t;
pub type __darwin_mach_port_t = __darwin_mach_port_name_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type __darwin_useconds_t = __uint32_t;
pub type __darwin_uuid_t = [::std::os::raw::c_uchar; 16usize];
pub type __darwin_uuid_string_t = [::std::os::raw::c_char; 37usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[test]
fn bindgen_test_layout___darwin_pthread_handler_rec() {
    assert_eq!(
        ::std::mem::size_of::<__darwin_pthread_handler_rec>(),
        24usize,
        concat!("Size of: ", stringify!(__darwin_pthread_handler_rec))
    );
    assert_eq!(
        ::std::mem::align_of::<__darwin_pthread_handler_rec>(),
        8usize,
        concat!("Alignment of ", stringify!(__darwin_pthread_handler_rec))
    );
    fn test_field___routine() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__darwin_pthread_handler_rec>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__routine) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__darwin_pthread_handler_rec),
                "::",
                stringify!(__routine)
            )
        );
    }
    test_field___routine();
    fn test_field___arg() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__darwin_pthread_handler_rec>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__arg) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(__darwin_pthread_handler_rec),
                "::",
                stringify!(__arg)
            )
        );
    }
    test_field___arg();
    fn test_field___next() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__darwin_pthread_handler_rec>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(__darwin_pthread_handler_rec),
                "::",
                stringify!(__next)
            )
        );
    }
    test_field___next();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_attr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_attr_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_attr_t>(),
        64usize,
        concat!("Size of: ", stringify!(_opaque_pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_attr_t))
    );
    fn test_field___sig() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_opaque_pthread_attr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_opaque_pthread_attr_t),
                "::",
                stringify!(__sig)
            )
        );
    }
    test_field___sig();
    fn test_field___opaque() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_opaque_pthread_attr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_opaque_pthread_attr_t),
                "::",
                stringify!(__opaque)
            )
        );
    }
    test_field___opaque();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_cond_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 40usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_cond_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(_opaque_pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_cond_t))
    );
    fn test_field___sig() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_opaque_pthread_cond_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_opaque_pthread_cond_t),
                "::",
                stringify!(__sig)
            )
        );
    }
    test_field___sig();
    fn test_field___opaque() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_opaque_pthread_cond_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_opaque_pthread_cond_t),
                "::",
                stringify!(__opaque)
            )
        );
    }
    test_field___opaque();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_condattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_condattr_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_condattr_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_condattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_condattr_t))
    );
    fn test_field___sig() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_opaque_pthread_condattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_opaque_pthread_condattr_t),
                "::",
                stringify!(__sig)
            )
        );
    }
    test_field___sig();
    fn test_field___opaque() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_opaque_pthread_condattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_opaque_pthread_condattr_t),
                "::",
                stringify!(__opaque)
            )
        );
    }
    test_field___opaque();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutex_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_mutex_t>(),
        64usize,
        concat!("Size of: ", stringify!(_opaque_pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_mutex_t))
    );
    fn test_field___sig() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_opaque_pthread_mutex_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_opaque_pthread_mutex_t),
                "::",
                stringify!(__sig)
            )
        );
    }
    test_field___sig();
    fn test_field___opaque() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_opaque_pthread_mutex_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_opaque_pthread_mutex_t),
                "::",
                stringify!(__opaque)
            )
        );
    }
    test_field___opaque();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutexattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutexattr_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_mutexattr_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_mutexattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_mutexattr_t))
    );
    fn test_field___sig() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_opaque_pthread_mutexattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_opaque_pthread_mutexattr_t),
                "::",
                stringify!(__sig)
            )
        );
    }
    test_field___sig();
    fn test_field___opaque() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_opaque_pthread_mutexattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_opaque_pthread_mutexattr_t),
                "::",
                stringify!(__opaque)
            )
        );
    }
    test_field___opaque();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_once_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_once_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_once_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_once_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_once_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_once_t))
    );
    fn test_field___sig() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_opaque_pthread_once_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_opaque_pthread_once_t),
                "::",
                stringify!(__sig)
            )
        );
    }
    test_field___sig();
    fn test_field___opaque() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_opaque_pthread_once_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_opaque_pthread_once_t),
                "::",
                stringify!(__opaque)
            )
        );
    }
    test_field___opaque();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlock_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 192usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlock_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_rwlock_t>(),
        200usize,
        concat!("Size of: ", stringify!(_opaque_pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_rwlock_t))
    );
    fn test_field___sig() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_opaque_pthread_rwlock_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_opaque_pthread_rwlock_t),
                "::",
                stringify!(__sig)
            )
        );
    }
    test_field___sig();
    fn test_field___opaque() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_opaque_pthread_rwlock_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_opaque_pthread_rwlock_t),
                "::",
                stringify!(__opaque)
            )
        );
    }
    test_field___opaque();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlockattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 16usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlockattr_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_rwlockattr_t>(),
        24usize,
        concat!("Size of: ", stringify!(_opaque_pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_rwlockattr_t))
    );
    fn test_field___sig() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_opaque_pthread_rwlockattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_opaque_pthread_rwlockattr_t),
                "::",
                stringify!(__sig)
            )
        );
    }
    test_field___sig();
    fn test_field___opaque() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_opaque_pthread_rwlockattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_opaque_pthread_rwlockattr_t),
                "::",
                stringify!(__opaque)
            )
        );
    }
    test_field___opaque();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_t {
    pub __sig: ::std::os::raw::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [::std::os::raw::c_char; 8176usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_t>(),
        8192usize,
        concat!("Size of: ", stringify!(_opaque_pthread_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_t))
    );
    fn test_field___sig() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_opaque_pthread_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_opaque_pthread_t),
                "::",
                stringify!(__sig)
            )
        );
    }
    test_field___sig();
    fn test_field___cleanup_stack() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_opaque_pthread_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__cleanup_stack) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_opaque_pthread_t),
                "::",
                stringify!(__cleanup_stack)
            )
        );
    }
    test_field___cleanup_stack();
    fn test_field___opaque() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_opaque_pthread_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(_opaque_pthread_t),
                "::",
                stringify!(__opaque)
            )
        );
    }
    test_field___opaque();
}
pub type __darwin_pthread_attr_t = _opaque_pthread_attr_t;
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_condattr_t = _opaque_pthread_condattr_t;
pub type __darwin_pthread_key_t = ::std::os::raw::c_ulong;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_mutexattr_t = _opaque_pthread_mutexattr_t;
pub type __darwin_pthread_once_t = _opaque_pthread_once_t;
pub type __darwin_pthread_rwlock_t = _opaque_pthread_rwlock_t;
pub type __darwin_pthread_rwlockattr_t = _opaque_pthread_rwlockattr_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type __darwin_nl_item = ::std::os::raw::c_int;
pub type __darwin_wctrans_t = ::std::os::raw::c_int;
pub type __darwin_wctype_t = __uint32_t;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulonglong;
pub type register_t = i64;
pub type user_addr_t = u_int64_t;
pub type user_size_t = u_int64_t;
pub type user_ssize_t = i64;
pub type user_long_t = i64;
pub type user_ulong_t = u_int64_t;
pub type user_time_t = i64;
pub type user_off_t = i64;
pub type syscall_arg_t = u_int64_t;
pub type va_list = __darwin_va_list;
pub type size_t = __darwin_size_t;
extern "C" {
    pub fn renameat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renamex_np(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameatx_np(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
        arg5: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
pub type fpos_t = __darwin_off_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut ::std::os::raw::c_uchar,
    pub _size: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___sbuf() {
    assert_eq!(
        ::std::mem::size_of::<__sbuf>(),
        16usize,
        concat!("Size of: ", stringify!(__sbuf))
    );
    assert_eq!(
        ::std::mem::align_of::<__sbuf>(),
        8usize,
        concat!("Alignment of ", stringify!(__sbuf))
    );
    fn test_field__base() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__sbuf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._base) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__sbuf),
                "::",
                stringify!(_base)
            )
        );
    }
    test_field__base();
    fn test_field__size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__sbuf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._size) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(__sbuf),
                "::",
                stringify!(_size)
            )
        );
    }
    test_field__size();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILEX {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut ::std::os::raw::c_uchar,
    pub _r: ::std::os::raw::c_int,
    pub _w: ::std::os::raw::c_int,
    pub _flags: ::std::os::raw::c_short,
    pub _file: ::std::os::raw::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: ::std::os::raw::c_int,
    pub _cookie: *mut ::std::os::raw::c_void,
    pub _close: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
    >,
    pub _read: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut ::std::os::raw::c_char,
            arg3: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _seek: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: fpos_t,
            arg3: ::std::os::raw::c_int,
        ) -> fpos_t,
    >,
    pub _write: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_char,
            arg3: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _ub: __sbuf,
    pub _extra: *mut __sFILEX,
    pub _ur: ::std::os::raw::c_int,
    pub _ubuf: [::std::os::raw::c_uchar; 3usize],
    pub _nbuf: [::std::os::raw::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: ::std::os::raw::c_int,
    pub _offset: fpos_t,
}
#[test]
fn bindgen_test_layout___sFILE() {
    assert_eq!(
        ::std::mem::size_of::<__sFILE>(),
        152usize,
        concat!("Size of: ", stringify!(__sFILE))
    );
    assert_eq!(
        ::std::mem::align_of::<__sFILE>(),
        8usize,
        concat!("Alignment of ", stringify!(__sFILE))
    );
    fn test_field__p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__sFILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__sFILE),
                "::",
                stringify!(_p)
            )
        );
    }
    test_field__p();
    fn test_field__r() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__sFILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._r) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(__sFILE),
                "::",
                stringify!(_r)
            )
        );
    }
    test_field__r();
    fn test_field__w() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__sFILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._w) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(__sFILE),
                "::",
                stringify!(_w)
            )
        );
    }
    test_field__w();
    fn test_field__flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__sFILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._flags) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(__sFILE),
                "::",
                stringify!(_flags)
            )
        );
    }
    test_field__flags();
    fn test_field__file() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__sFILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._file) as usize - ptr as usize
            },
            18usize,
            concat!(
                "Offset of field: ",
                stringify!(__sFILE),
                "::",
                stringify!(_file)
            )
        );
    }
    test_field__file();
    fn test_field__bf() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__sFILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._bf) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(__sFILE),
                "::",
                stringify!(_bf)
            )
        );
    }
    test_field__bf();
    fn test_field__lbfsize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__sFILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._lbfsize) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(__sFILE),
                "::",
                stringify!(_lbfsize)
            )
        );
    }
    test_field__lbfsize();
    fn test_field__cookie() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__sFILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._cookie) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(__sFILE),
                "::",
                stringify!(_cookie)
            )
        );
    }
    test_field__cookie();
    fn test_field__close() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__sFILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._close) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(__sFILE),
                "::",
                stringify!(_close)
            )
        );
    }
    test_field__close();
    fn test_field__read() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__sFILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._read) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(__sFILE),
                "::",
                stringify!(_read)
            )
        );
    }
    test_field__read();
    fn test_field__seek() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__sFILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._seek) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(__sFILE),
                "::",
                stringify!(_seek)
            )
        );
    }
    test_field__seek();
    fn test_field__write() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__sFILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._write) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(__sFILE),
                "::",
                stringify!(_write)
            )
        );
    }
    test_field__write();
    fn test_field__ub() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__sFILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._ub) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(__sFILE),
                "::",
                stringify!(_ub)
            )
        );
    }
    test_field__ub();
    fn test_field__extra() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__sFILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._extra) as usize - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(__sFILE),
                "::",
                stringify!(_extra)
            )
        );
    }
    test_field__extra();
    fn test_field__ur() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__sFILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._ur) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(__sFILE),
                "::",
                stringify!(_ur)
            )
        );
    }
    test_field__ur();
    fn test_field__ubuf() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__sFILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._ubuf) as usize - ptr as usize
            },
            116usize,
            concat!(
                "Offset of field: ",
                stringify!(__sFILE),
                "::",
                stringify!(_ubuf)
            )
        );
    }
    test_field__ubuf();
    fn test_field__nbuf() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__sFILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._nbuf) as usize - ptr as usize
            },
            119usize,
            concat!(
                "Offset of field: ",
                stringify!(__sFILE),
                "::",
                stringify!(_nbuf)
            )
        );
    }
    test_field__nbuf();
    fn test_field__lb() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__sFILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._lb) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(__sFILE),
                "::",
                stringify!(_lb)
            )
        );
    }
    test_field__lb();
    fn test_field__blksize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__sFILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._blksize) as usize - ptr as usize
            },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(__sFILE),
                "::",
                stringify!(_blksize)
            )
        );
    }
    test_field__blksize();
    fn test_field__offset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__sFILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._offset) as usize - ptr as usize
            },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(__sFILE),
                "::",
                stringify!(_offset)
            )
        );
    }
    test_field__offset();
}
pub type FILE = __sFILE;
extern "C" {
    pub static mut __stdinp: *mut FILE;
}
extern "C" {
    pub static mut __stdoutp: *mut FILE;
}
extern "C" {
    pub static mut __stderrp: *mut FILE;
}
extern "C" {
    pub fn clearerr(arg1: *mut FILE);
}
extern "C" {
    pub fn fclose(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn feof(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetpos(arg1: *mut FILE, arg2: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fprintf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputs(arg1: *const ::std::os::raw::c_char, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __nitems: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn freopen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fscanf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fseek(
        arg1: *mut FILE,
        arg2: ::std::os::raw::c_long,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(arg1: *mut FILE, arg2: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(arg1: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __nitems: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn getc(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gets(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn perror(arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn printf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn remove(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rewind(arg1: *mut FILE);
}
extern "C" {
    pub fn scanf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuf(arg1: *mut FILE, arg2: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        arg1: *mut FILE,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ungetc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fdopen(arg1: ::std::os::raw::c_int, arg2: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn fileno(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pclose(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn __srget(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __svfscanf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __swbuf(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn flockfile(arg1: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(arg1: *mut FILE);
}
extern "C" {
    pub fn getc_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __prefix: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type off_t = __darwin_off_t;
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __offset: off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> off_t;
}
extern "C" {
    pub fn snprintf(
        __str: *mut ::std::os::raw::c_char,
        __size: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        arg1: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        arg1: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __str: *mut ::std::os::raw::c_char,
        __size: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        arg1: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        __str: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        arg1: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
pub type ssize_t = __darwin_ssize_t;
extern "C" {
    pub fn dprintf(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getdelim(
        __linep: *mut *mut ::std::os::raw::c_char,
        __linecapp: *mut size_t,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> ssize_t;
}
extern "C" {
    pub fn getline(
        __linep: *mut *mut ::std::os::raw::c_char,
        __linecapp: *mut size_t,
        __stream: *mut FILE,
    ) -> ssize_t;
}
extern "C" {
    pub fn fmemopen(
        __buf: *mut ::std::os::raw::c_void,
        __size: size_t,
        __mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufp: *mut *mut ::std::os::raw::c_char,
        __sizep: *mut size_t,
    ) -> *mut FILE;
}
extern "C" {
    pub static sys_nerr: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub fn asprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid_r(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fgetln(arg1: *mut FILE, arg2: *mut size_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fmtcheck(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn fpurge(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(
        arg1: *mut FILE,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn setlinebuf(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vasprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zopen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> *mut FILE;
}
extern "C" {
    pub fn funopen(
        arg1: *const ::std::os::raw::c_void,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *mut ::std::os::raw::c_char,
                arg3: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_char,
                arg3: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
        arg4: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: fpos_t,
                arg3: ::std::os::raw::c_int,
            ) -> fpos_t,
        >,
        arg5: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
        >,
    ) -> *mut FILE;
}
extern "C" {
    pub fn __sprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: size_t,
        arg4: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __snprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        arg2: size_t,
        arg3: ::std::os::raw::c_int,
        arg4: size_t,
        arg5: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __vsprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: size_t,
        arg4: *const ::std::os::raw::c_char,
        arg5: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __vsnprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        arg2: size_t,
        arg3: ::std::os::raw::c_int,
        arg4: size_t,
        arg5: *const ::std::os::raw::c_char,
        arg6: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
#[doc = "< The value is 1"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_PAYLOAD_FORMAT_INDICATOR: MQTTPropertyCodes = 1;
#[doc = "< The value is 2"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_MESSAGE_EXPIRY_INTERVAL: MQTTPropertyCodes = 2;
#[doc = "< The value is 3"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_CONTENT_TYPE: MQTTPropertyCodes = 3;
#[doc = "< The value is 8"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_RESPONSE_TOPIC: MQTTPropertyCodes = 8;
#[doc = "< The value is 9"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_CORRELATION_DATA: MQTTPropertyCodes = 9;
#[doc = "< The value is 11"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_SUBSCRIPTION_IDENTIFIER: MQTTPropertyCodes = 11;
#[doc = "< The value is 17"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_SESSION_EXPIRY_INTERVAL: MQTTPropertyCodes = 17;
#[doc = "< The value is 18"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_ASSIGNED_CLIENT_IDENTIFER: MQTTPropertyCodes = 18;
#[doc = "< The value is 19"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_SERVER_KEEP_ALIVE: MQTTPropertyCodes = 19;
#[doc = "< The value is 21"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_AUTHENTICATION_METHOD: MQTTPropertyCodes = 21;
#[doc = "< The value is 22"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_AUTHENTICATION_DATA: MQTTPropertyCodes = 22;
#[doc = "< The value is 23"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_REQUEST_PROBLEM_INFORMATION: MQTTPropertyCodes = 23;
#[doc = "< The value is 24"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_WILL_DELAY_INTERVAL: MQTTPropertyCodes = 24;
#[doc = "< The value is 25"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_REQUEST_RESPONSE_INFORMATION: MQTTPropertyCodes = 25;
#[doc = "< The value is 26"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_RESPONSE_INFORMATION: MQTTPropertyCodes = 26;
#[doc = "< The value is 28"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_SERVER_REFERENCE: MQTTPropertyCodes = 28;
#[doc = "< The value is 31"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_REASON_STRING: MQTTPropertyCodes = 31;
#[doc = "< The value is 33"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_RECEIVE_MAXIMUM: MQTTPropertyCodes = 33;
#[doc = "< The value is 34"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_TOPIC_ALIAS_MAXIMUM: MQTTPropertyCodes = 34;
#[doc = "< The value is 35"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_TOPIC_ALIAS: MQTTPropertyCodes = 35;
#[doc = "< The value is 36"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_MAXIMUM_QOS: MQTTPropertyCodes = 36;
#[doc = "< The value is 37"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_RETAIN_AVAILABLE: MQTTPropertyCodes = 37;
#[doc = "< The value is 38"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_USER_PROPERTY: MQTTPropertyCodes = 38;
#[doc = "< The value is 39"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_MAXIMUM_PACKET_SIZE: MQTTPropertyCodes = 39;
#[doc = "< The value is 40"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_WILDCARD_SUBSCRIPTION_AVAILABLE: MQTTPropertyCodes =
    40;
#[doc = "< The value is 41"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_SUBSCRIPTION_IDENTIFIERS_AVAILABLE:
    MQTTPropertyCodes = 41;
#[doc = "< The value is 241"]
pub const MQTTPropertyCodes_MQTTPROPERTY_CODE_SHARED_SUBSCRIPTION_AVAILABLE: MQTTPropertyCodes = 42;
#[doc = " The one byte MQTT V5 property indicator"]
pub type MQTTPropertyCodes = ::std::os::raw::c_uint;
extern "C" {
    #[doc = " Returns a printable string description of an MQTT V5 property code."]
    #[doc = " @param value an MQTT V5 property code."]
    #[doc = " @return the printable string description of the input property code."]
    #[doc = " NULL if the code was not found."]
    pub fn MQTTPropertyName(value: MQTTPropertyCodes) -> *const ::std::os::raw::c_char;
}
pub const MQTTPropertyTypes_MQTTPROPERTY_TYPE_BYTE: MQTTPropertyTypes = 0;
pub const MQTTPropertyTypes_MQTTPROPERTY_TYPE_TWO_BYTE_INTEGER: MQTTPropertyTypes = 1;
pub const MQTTPropertyTypes_MQTTPROPERTY_TYPE_FOUR_BYTE_INTEGER: MQTTPropertyTypes = 2;
pub const MQTTPropertyTypes_MQTTPROPERTY_TYPE_VARIABLE_BYTE_INTEGER: MQTTPropertyTypes = 3;
pub const MQTTPropertyTypes_MQTTPROPERTY_TYPE_BINARY_DATA: MQTTPropertyTypes = 4;
pub const MQTTPropertyTypes_MQTTPROPERTY_TYPE_UTF_8_ENCODED_STRING: MQTTPropertyTypes = 5;
pub const MQTTPropertyTypes_MQTTPROPERTY_TYPE_UTF_8_STRING_PAIR: MQTTPropertyTypes = 6;
#[doc = " The one byte MQTT V5 property type"]
pub type MQTTPropertyTypes = ::std::os::raw::c_uint;
extern "C" {
    #[doc = " Returns the MQTT V5 type code of an MQTT V5 property."]
    #[doc = " @param value an MQTT V5 property code."]
    #[doc = " @return the MQTT V5 type code of the input property. -1 if the code was not found."]
    pub fn MQTTProperty_getType(value: MQTTPropertyCodes) -> ::std::os::raw::c_int;
}
#[doc = " The data for a length delimited string"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MQTTLenString {
    #[doc = "< the length of the string"]
    pub len: ::std::os::raw::c_int,
    #[doc = "< pointer to the string data"]
    pub data: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_MQTTLenString() {
    assert_eq!(
        ::std::mem::size_of::<MQTTLenString>(),
        16usize,
        concat!("Size of: ", stringify!(MQTTLenString))
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTLenString>(),
        8usize,
        concat!("Alignment of ", stringify!(MQTTLenString))
    );
    fn test_field_len() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTLenString>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTLenString),
                "::",
                stringify!(len)
            )
        );
    }
    test_field_len();
    fn test_field_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTLenString>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTLenString),
                "::",
                stringify!(data)
            )
        );
    }
    test_field_data();
}
#[doc = " Structure to hold an MQTT version 5 property of any type"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct MQTTProperty {
    #[doc = "<  The MQTT V5 property id. A multi-byte integer."]
    pub identifier: MQTTPropertyCodes,
    pub value: MQTTProperty__bindgen_ty_1,
}
#[doc = " The value of the property, as a union of the different possible types."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union MQTTProperty__bindgen_ty_1 {
    #[doc = "< holds the value of a byte property type"]
    pub byte: ::std::os::raw::c_uchar,
    #[doc = "< holds the value of a 2 byte integer property type"]
    pub integer2: ::std::os::raw::c_ushort,
    #[doc = "< holds the value of a 4 byte integer property type"]
    pub integer4: ::std::os::raw::c_uint,
    pub __bindgen_anon_1: MQTTProperty__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MQTTProperty__bindgen_ty_1__bindgen_ty_1 {
    #[doc = "< The value of a string property, or the name of a user property."]
    pub data: MQTTLenString,
    #[doc = "< The value of a user property."]
    pub value: MQTTLenString,
}
#[test]
fn bindgen_test_layout_MQTTProperty__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<MQTTProperty__bindgen_ty_1__bindgen_ty_1>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(MQTTProperty__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTProperty__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(MQTTProperty__bindgen_ty_1__bindgen_ty_1)
        )
    );
    fn test_field_data() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<MQTTProperty__bindgen_ty_1__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTProperty__bindgen_ty_1__bindgen_ty_1),
                "::",
                stringify!(data)
            )
        );
    }
    test_field_data();
    fn test_field_value() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<MQTTProperty__bindgen_ty_1__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTProperty__bindgen_ty_1__bindgen_ty_1),
                "::",
                stringify!(value)
            )
        );
    }
    test_field_value();
}
#[test]
fn bindgen_test_layout_MQTTProperty__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<MQTTProperty__bindgen_ty_1>(),
        32usize,
        concat!("Size of: ", stringify!(MQTTProperty__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTProperty__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(MQTTProperty__bindgen_ty_1))
    );
    fn test_field_byte() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTProperty__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).byte) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTProperty__bindgen_ty_1),
                "::",
                stringify!(byte)
            )
        );
    }
    test_field_byte();
    fn test_field_integer2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTProperty__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).integer2) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTProperty__bindgen_ty_1),
                "::",
                stringify!(integer2)
            )
        );
    }
    test_field_integer2();
    fn test_field_integer4() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTProperty__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).integer4) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTProperty__bindgen_ty_1),
                "::",
                stringify!(integer4)
            )
        );
    }
    test_field_integer4();
}
#[test]
fn bindgen_test_layout_MQTTProperty() {
    assert_eq!(
        ::std::mem::size_of::<MQTTProperty>(),
        40usize,
        concat!("Size of: ", stringify!(MQTTProperty))
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTProperty>(),
        8usize,
        concat!("Alignment of ", stringify!(MQTTProperty))
    );
    fn test_field_identifier() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTProperty>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).identifier) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTProperty),
                "::",
                stringify!(identifier)
            )
        );
    }
    test_field_identifier();
    fn test_field_value() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTProperty>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTProperty),
                "::",
                stringify!(value)
            )
        );
    }
    test_field_value();
}
#[doc = " MQTT version 5 property list"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MQTTProperties {
    #[doc = "< number of property entries in the array"]
    pub count: ::std::os::raw::c_int,
    #[doc = "< max number of properties that the currently allocated array can store"]
    pub max_count: ::std::os::raw::c_int,
    #[doc = "< mbi: byte length of all properties"]
    pub length: ::std::os::raw::c_int,
    #[doc = "< array of properties"]
    pub array: *mut MQTTProperty,
}
#[test]
fn bindgen_test_layout_MQTTProperties() {
    assert_eq!(
        ::std::mem::size_of::<MQTTProperties>(),
        24usize,
        concat!("Size of: ", stringify!(MQTTProperties))
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTProperties>(),
        8usize,
        concat!("Alignment of ", stringify!(MQTTProperties))
    );
    fn test_field_count() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTProperties),
                "::",
                stringify!(count)
            )
        );
    }
    test_field_count();
    fn test_field_max_count() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).max_count) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTProperties),
                "::",
                stringify!(max_count)
            )
        );
    }
    test_field_max_count();
    fn test_field_length() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTProperties),
                "::",
                stringify!(length)
            )
        );
    }
    test_field_length();
    fn test_field_array() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).array) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTProperties),
                "::",
                stringify!(array)
            )
        );
    }
    test_field_array();
}
extern "C" {
    #[doc = " Returns the length of the properties structure when serialized ready for network transmission."]
    #[doc = " @param props an MQTT V5 property structure."]
    #[doc = " @return the length in bytes of the properties when serialized."]
    pub fn MQTTProperties_len(props: *mut MQTTProperties) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Add a property pointer to the property array.  There is no memory allocation."]
    #[doc = " @param props The property list to add the property to."]
    #[doc = " @param prop The property to add to the list."]
    #[doc = " @return 0 on success, -1 on failure."]
    pub fn MQTTProperties_add(
        props: *mut MQTTProperties,
        prop: *const MQTTProperty,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Serialize the given property list to a character buffer, e.g. for writing to the network."]
    #[doc = " @param pptr pointer to the buffer - move the pointer as we add data"]
    #[doc = " @param properties pointer to the property list, can be NULL"]
    #[doc = " @return whether the write succeeded or not: number of bytes written, or < 0 on failure."]
    pub fn MQTTProperties_write(
        pptr: *mut *mut ::std::os::raw::c_char,
        properties: *const MQTTProperties,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Reads a property list from a character buffer into an array."]
    #[doc = " @param properties pointer to the property list to be filled. Should be initalized but empty."]
    #[doc = " @param pptr pointer to the character buffer."]
    #[doc = " @param enddata pointer to the end of the character buffer so we don't read beyond."]
    #[doc = " @return 1 if the properties were read successfully."]
    pub fn MQTTProperties_read(
        properties: *mut MQTTProperties,
        pptr: *mut *mut ::std::os::raw::c_char,
        enddata: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Free all memory allocated to the property list, including any to individual properties."]
    #[doc = " @param properties pointer to the property list."]
    pub fn MQTTProperties_free(properties: *mut MQTTProperties);
}
extern "C" {
    #[doc = " Copy the contents of a property list, allocating additional memory if needed."]
    #[doc = " @param props pointer to the property list."]
    #[doc = " @return the duplicated property list."]
    pub fn MQTTProperties_copy(props: *const MQTTProperties) -> MQTTProperties;
}
extern "C" {
    #[doc = " Checks if property list contains a specific property."]
    #[doc = " @param props pointer to the property list."]
    #[doc = " @param propid the property id to check for."]
    #[doc = " @return 1 if found, 0 if not."]
    pub fn MQTTProperties_hasProperty(
        props: *mut MQTTProperties,
        propid: MQTTPropertyCodes,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Returns the number of instances of a property id. Most properties can exist only once."]
    #[doc = " User properties and subscription ids can exist more than once."]
    #[doc = " @param props pointer to the property list."]
    #[doc = " @param propid the property id to check for."]
    #[doc = " @return the number of times found.  Can be 0."]
    pub fn MQTTProperties_propertyCount(
        props: *mut MQTTProperties,
        propid: MQTTPropertyCodes,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Returns the integer value of a specific property.  The property given must be a numeric type."]
    #[doc = " @param props pointer to the property list."]
    #[doc = " @param propid the property id to check for."]
    #[doc = " @return the integer value of the property. -9999999 on failure."]
    pub fn MQTTProperties_getNumericValue(
        props: *mut MQTTProperties,
        propid: MQTTPropertyCodes,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Returns the integer value of a specific property when it's not the only instance."]
    #[doc = " The property given must be a numeric type."]
    #[doc = " @param props pointer to the property list."]
    #[doc = " @param propid the property id to check for."]
    #[doc = " @param index the instance number, starting at 0."]
    #[doc = " @return the integer value of the property. -9999999 on failure."]
    pub fn MQTTProperties_getNumericValueAt(
        props: *mut MQTTProperties,
        propid: MQTTPropertyCodes,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Returns a pointer to the property structure for a specific property."]
    #[doc = " @param props pointer to the property list."]
    #[doc = " @param propid the property id to check for."]
    #[doc = " @return the pointer to the property structure if found.  NULL if not found."]
    pub fn MQTTProperties_getProperty(
        props: *mut MQTTProperties,
        propid: MQTTPropertyCodes,
    ) -> *mut MQTTProperty;
}
extern "C" {
    #[doc = " Returns a pointer to the property structure for a specific property when it's not the only instance."]
    #[doc = " @param props pointer to the property list."]
    #[doc = " @param propid the property id to check for."]
    #[doc = " @param index the instance number, starting at 0."]
    #[doc = " @return the pointer to the property structure if found.  NULL if not found."]
    pub fn MQTTProperties_getPropertyAt(
        props: *mut MQTTProperties,
        propid: MQTTPropertyCodes,
        index: ::std::os::raw::c_int,
    ) -> *mut MQTTProperty;
}
pub const MQTTReasonCodes_MQTTREASONCODE_SUCCESS: MQTTReasonCodes = 0;
pub const MQTTReasonCodes_MQTTREASONCODE_NORMAL_DISCONNECTION: MQTTReasonCodes = 0;
pub const MQTTReasonCodes_MQTTREASONCODE_GRANTED_QOS_0: MQTTReasonCodes = 0;
pub const MQTTReasonCodes_MQTTREASONCODE_GRANTED_QOS_1: MQTTReasonCodes = 1;
pub const MQTTReasonCodes_MQTTREASONCODE_GRANTED_QOS_2: MQTTReasonCodes = 2;
pub const MQTTReasonCodes_MQTTREASONCODE_DISCONNECT_WITH_WILL_MESSAGE: MQTTReasonCodes = 4;
pub const MQTTReasonCodes_MQTTREASONCODE_NO_MATCHING_SUBSCRIBERS: MQTTReasonCodes = 16;
pub const MQTTReasonCodes_MQTTREASONCODE_NO_SUBSCRIPTION_FOUND: MQTTReasonCodes = 17;
pub const MQTTReasonCodes_MQTTREASONCODE_CONTINUE_AUTHENTICATION: MQTTReasonCodes = 24;
pub const MQTTReasonCodes_MQTTREASONCODE_RE_AUTHENTICATE: MQTTReasonCodes = 25;
pub const MQTTReasonCodes_MQTTREASONCODE_UNSPECIFIED_ERROR: MQTTReasonCodes = 128;
pub const MQTTReasonCodes_MQTTREASONCODE_MALFORMED_PACKET: MQTTReasonCodes = 129;
pub const MQTTReasonCodes_MQTTREASONCODE_PROTOCOL_ERROR: MQTTReasonCodes = 130;
pub const MQTTReasonCodes_MQTTREASONCODE_IMPLEMENTATION_SPECIFIC_ERROR: MQTTReasonCodes = 131;
pub const MQTTReasonCodes_MQTTREASONCODE_UNSUPPORTED_PROTOCOL_VERSION: MQTTReasonCodes = 132;
pub const MQTTReasonCodes_MQTTREASONCODE_CLIENT_IDENTIFIER_NOT_VALID: MQTTReasonCodes = 133;
pub const MQTTReasonCodes_MQTTREASONCODE_BAD_USER_NAME_OR_PASSWORD: MQTTReasonCodes = 134;
pub const MQTTReasonCodes_MQTTREASONCODE_NOT_AUTHORIZED: MQTTReasonCodes = 135;
pub const MQTTReasonCodes_MQTTREASONCODE_SERVER_UNAVAILABLE: MQTTReasonCodes = 136;
pub const MQTTReasonCodes_MQTTREASONCODE_SERVER_BUSY: MQTTReasonCodes = 137;
pub const MQTTReasonCodes_MQTTREASONCODE_BANNED: MQTTReasonCodes = 138;
pub const MQTTReasonCodes_MQTTREASONCODE_SERVER_SHUTTING_DOWN: MQTTReasonCodes = 139;
pub const MQTTReasonCodes_MQTTREASONCODE_BAD_AUTHENTICATION_METHOD: MQTTReasonCodes = 140;
pub const MQTTReasonCodes_MQTTREASONCODE_KEEP_ALIVE_TIMEOUT: MQTTReasonCodes = 141;
pub const MQTTReasonCodes_MQTTREASONCODE_SESSION_TAKEN_OVER: MQTTReasonCodes = 142;
pub const MQTTReasonCodes_MQTTREASONCODE_TOPIC_FILTER_INVALID: MQTTReasonCodes = 143;
pub const MQTTReasonCodes_MQTTREASONCODE_TOPIC_NAME_INVALID: MQTTReasonCodes = 144;
pub const MQTTReasonCodes_MQTTREASONCODE_PACKET_IDENTIFIER_IN_USE: MQTTReasonCodes = 145;
pub const MQTTReasonCodes_MQTTREASONCODE_PACKET_IDENTIFIER_NOT_FOUND: MQTTReasonCodes = 146;
pub const MQTTReasonCodes_MQTTREASONCODE_RECEIVE_MAXIMUM_EXCEEDED: MQTTReasonCodes = 147;
pub const MQTTReasonCodes_MQTTREASONCODE_TOPIC_ALIAS_INVALID: MQTTReasonCodes = 148;
pub const MQTTReasonCodes_MQTTREASONCODE_PACKET_TOO_LARGE: MQTTReasonCodes = 149;
pub const MQTTReasonCodes_MQTTREASONCODE_MESSAGE_RATE_TOO_HIGH: MQTTReasonCodes = 150;
pub const MQTTReasonCodes_MQTTREASONCODE_QUOTA_EXCEEDED: MQTTReasonCodes = 151;
pub const MQTTReasonCodes_MQTTREASONCODE_ADMINISTRATIVE_ACTION: MQTTReasonCodes = 152;
pub const MQTTReasonCodes_MQTTREASONCODE_PAYLOAD_FORMAT_INVALID: MQTTReasonCodes = 153;
pub const MQTTReasonCodes_MQTTREASONCODE_RETAIN_NOT_SUPPORTED: MQTTReasonCodes = 154;
pub const MQTTReasonCodes_MQTTREASONCODE_QOS_NOT_SUPPORTED: MQTTReasonCodes = 155;
pub const MQTTReasonCodes_MQTTREASONCODE_USE_ANOTHER_SERVER: MQTTReasonCodes = 156;
pub const MQTTReasonCodes_MQTTREASONCODE_SERVER_MOVED: MQTTReasonCodes = 157;
pub const MQTTReasonCodes_MQTTREASONCODE_SHARED_SUBSCRIPTIONS_NOT_SUPPORTED: MQTTReasonCodes = 158;
pub const MQTTReasonCodes_MQTTREASONCODE_CONNECTION_RATE_EXCEEDED: MQTTReasonCodes = 159;
pub const MQTTReasonCodes_MQTTREASONCODE_MAXIMUM_CONNECT_TIME: MQTTReasonCodes = 160;
pub const MQTTReasonCodes_MQTTREASONCODE_SUBSCRIPTION_IDENTIFIERS_NOT_SUPPORTED: MQTTReasonCodes =
    161;
pub const MQTTReasonCodes_MQTTREASONCODE_WILDCARD_SUBSCRIPTIONS_NOT_SUPPORTED: MQTTReasonCodes =
    162;
#[doc = " The MQTT V5 one byte reason code"]
pub type MQTTReasonCodes = ::std::os::raw::c_uint;
extern "C" {
    #[doc = " Returns a printable string description of an MQTT V5 reason code."]
    #[doc = " @param value an MQTT V5 reason code."]
    #[doc = " @return the printable string description of the input reason code."]
    #[doc = " NULL if the code was not found."]
    pub fn MQTTReasonCode_toString(value: MQTTReasonCodes) -> *const ::std::os::raw::c_char;
}
#[doc = " The MQTT V5 subscribe options, apart from QoS which existed before V5."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MQTTSubscribe_options {
    #[doc = " The eyecatcher for this structure. Must be MQSO."]
    pub struct_id: [::std::os::raw::c_char; 4usize],
    #[doc = " The version number of this structure.  Must be 0."]
    pub struct_version: ::std::os::raw::c_int,
    #[doc = " To not receive our own publications, set to 1."]
    #[doc = "  0 is the original MQTT behaviour - all messages matching the subscription are received."]
    pub noLocal: ::std::os::raw::c_uchar,
    #[doc = " To keep the retain flag as on the original publish message, set to 1."]
    #[doc = "  If 0, defaults to the original MQTT behaviour where the retain flag is only set on"]
    #[doc = "  publications sent by a broker if in response to a subscribe request."]
    pub retainAsPublished: ::std::os::raw::c_uchar,
    #[doc = " 0 - send retained messages at the time of the subscribe (original MQTT behaviour)"]
    #[doc = "  1 - send retained messages on subscribe only if the subscription is new"]
    #[doc = "  2 - do not send retained messages at all"]
    pub retainHandling: ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout_MQTTSubscribe_options() {
    assert_eq!(
        ::std::mem::size_of::<MQTTSubscribe_options>(),
        12usize,
        concat!("Size of: ", stringify!(MQTTSubscribe_options))
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTSubscribe_options>(),
        4usize,
        concat!("Alignment of ", stringify!(MQTTSubscribe_options))
    );
    fn test_field_struct_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTSubscribe_options>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).struct_id) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTSubscribe_options),
                "::",
                stringify!(struct_id)
            )
        );
    }
    test_field_struct_id();
    fn test_field_struct_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTSubscribe_options>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).struct_version) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTSubscribe_options),
                "::",
                stringify!(struct_version)
            )
        );
    }
    test_field_struct_version();
    fn test_field_noLocal() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTSubscribe_options>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).noLocal) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTSubscribe_options),
                "::",
                stringify!(noLocal)
            )
        );
    }
    test_field_noLocal();
    fn test_field_retainAsPublished() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTSubscribe_options>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).retainAsPublished) as usize - ptr as usize
            },
            9usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTSubscribe_options),
                "::",
                stringify!(retainAsPublished)
            )
        );
    }
    test_field_retainAsPublished();
    fn test_field_retainHandling() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTSubscribe_options>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).retainHandling) as usize - ptr as usize
            },
            10usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTSubscribe_options),
                "::",
                stringify!(retainHandling)
            )
        );
    }
    test_field_retainHandling();
}
#[doc = " @brief Initialize the persistent store."]
#[doc = ""]
#[doc = " Either open the existing persistent store for this client ID or create a new"]
#[doc = " one if one doesn't exist. If the persistent store is already open, return"]
#[doc = " without taking any action."]
#[doc = ""]
#[doc = " An application can use the same client identifier to connect to many"]
#[doc = " different servers. The <i>clientid</i> in conjunction with the"]
#[doc = " <i>serverURI</i> uniquely identifies the persistence store required."]
#[doc = ""]
#[doc = " @param handle The address of a pointer to a handle for this persistence"]
#[doc = " implementation. This function must set handle to a valid reference to the"]
#[doc = " persistence following a successful return."]
#[doc = " The handle pointer is passed as an argument to all the other"]
#[doc = " persistence functions. It may include the context parameter and/or any other"]
#[doc = " data for use by the persistence functions."]
#[doc = " @param clientID The client identifier for which the persistent store should"]
#[doc = " be opened."]
#[doc = " @param serverURI The connection string specified when the MQTT client was"]
#[doc = " created (see MQTTClient_create())."]
#[doc = " @param context A pointer to any data required to initialize the persistent"]
#[doc = " store (see ::MQTTClient_persistence)."]
#[doc = " @return Return 0 if the function completes successfully, otherwise return"]
#[doc = " ::MQTTCLIENT_PERSISTENCE_ERROR."]
pub type Persistence_open = ::std::option::Option<
    unsafe extern "C" fn(
        handle: *mut *mut ::std::os::raw::c_void,
        clientID: *const ::std::os::raw::c_char,
        serverURI: *const ::std::os::raw::c_char,
        context: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @brief Close the persistent store referred to by the handle."]
#[doc = ""]
#[doc = " @param handle The handle pointer from a successful call to"]
#[doc = " Persistence_open()."]
#[doc = " @return Return 0 if the function completes successfully, otherwise return"]
#[doc = " ::MQTTCLIENT_PERSISTENCE_ERROR."]
pub type Persistence_close = ::std::option::Option<
    unsafe extern "C" fn(handle: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
#[doc = " @brief Put the specified data into the persistent store."]
#[doc = ""]
#[doc = " @param handle The handle pointer from a successful call to"]
#[doc = " Persistence_open()."]
#[doc = " @param key A string used as the key for the data to be put in the store. The"]
#[doc = " key is later used to retrieve data from the store with Persistence_get()."]
#[doc = " @param bufcount The number of buffers to write to the persistence store."]
#[doc = " @param buffers An array of pointers to the data buffers associated with"]
#[doc = " this <i>key</i>."]
#[doc = " @param buflens An array of lengths of the data buffers. <i>buflen[n]</i>"]
#[doc = " gives the length of <i>buffer[n]</i>."]
#[doc = " @return Return 0 if the function completes successfully, otherwise return"]
#[doc = " ::MQTTCLIENT_PERSISTENCE_ERROR."]
pub type Persistence_put = ::std::option::Option<
    unsafe extern "C" fn(
        handle: *mut ::std::os::raw::c_void,
        key: *mut ::std::os::raw::c_char,
        bufcount: ::std::os::raw::c_int,
        buffers: *mut *mut ::std::os::raw::c_char,
        buflens: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @brief Retrieve the specified data from the persistent store."]
#[doc = ""]
#[doc = " @param handle The handle pointer from a successful call to"]
#[doc = " Persistence_open()."]
#[doc = " @param key A string that is the key for the data to be retrieved. This is"]
#[doc = " the same key used to save the data to the store with Persistence_put()."]
#[doc = " @param buffer The address of a pointer to a buffer. This function sets the"]
#[doc = " pointer to point at the retrieved data, if successful."]
#[doc = " @param buflen The address of an int that is set to the length of"]
#[doc = " <i>buffer</i> by this function if successful."]
#[doc = " @return Return 0 if the function completes successfully, otherwise return"]
#[doc = " ::MQTTCLIENT_PERSISTENCE_ERROR."]
pub type Persistence_get = ::std::option::Option<
    unsafe extern "C" fn(
        handle: *mut ::std::os::raw::c_void,
        key: *mut ::std::os::raw::c_char,
        buffer: *mut *mut ::std::os::raw::c_char,
        buflen: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @brief Remove the data for the specified key from the store."]
#[doc = ""]
#[doc = " @param handle The handle pointer from a successful call to"]
#[doc = " Persistence_open()."]
#[doc = " @param key A string that is the key for the data to be removed from the"]
#[doc = " store. This is the same key used to save the data to the store with"]
#[doc = " Persistence_put()."]
#[doc = " @return Return 0 if the function completes successfully, otherwise return"]
#[doc = " ::MQTTCLIENT_PERSISTENCE_ERROR."]
pub type Persistence_remove = ::std::option::Option<
    unsafe extern "C" fn(
        handle: *mut ::std::os::raw::c_void,
        key: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @brief Returns the keys in this persistent data store."]
#[doc = ""]
#[doc = " @param handle The handle pointer from a successful call to"]
#[doc = " Persistence_open()."]
#[doc = " @param keys The address of a pointer to pointers to strings. Assuming"]
#[doc = " successful execution, this function allocates memory to hold the returned"]
#[doc = " keys (strings used to store the data with Persistence_put()). It also"]
#[doc = " allocates memory to hold an array of pointers to these strings. <i>keys</i>"]
#[doc = " is set to point to the array of pointers to strings."]
#[doc = " @param nkeys A pointer to the number of keys in this persistent data store."]
#[doc = " This function sets the number of keys, if successful."]
#[doc = " @return Return 0 if the function completes successfully, otherwise return"]
#[doc = " ::MQTTCLIENT_PERSISTENCE_ERROR."]
pub type Persistence_keys = ::std::option::Option<
    unsafe extern "C" fn(
        handle: *mut ::std::os::raw::c_void,
        keys: *mut *mut *mut ::std::os::raw::c_char,
        nkeys: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @brief Clears the persistence store, so that it no longer contains any"]
#[doc = " persisted data."]
#[doc = ""]
#[doc = " @param handle The handle pointer from a successful call to"]
#[doc = " Persistence_open()."]
#[doc = " @return Return 0 if the function completes successfully, otherwise return"]
#[doc = " ::MQTTCLIENT_PERSISTENCE_ERROR."]
pub type Persistence_clear = ::std::option::Option<
    unsafe extern "C" fn(handle: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
#[doc = " @brief Returns whether any data has been persisted using the specified key."]
#[doc = ""]
#[doc = " @param handle The handle pointer from a successful call to"]
#[doc = " Persistence_open()."]
#[doc = " @param key The string to be tested for existence in the store."]
#[doc = " @return Return 0 if the key was found in the store, otherwise return"]
#[doc = " ::MQTTCLIENT_PERSISTENCE_ERROR."]
pub type Persistence_containskey = ::std::option::Option<
    unsafe extern "C" fn(
        handle: *mut ::std::os::raw::c_void,
        key: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @brief A structure containing the function pointers to a persistence"]
#[doc = " implementation and the context or state that will be shared across all"]
#[doc = " the persistence functions."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MQTTClient_persistence {
    #[doc = " A pointer to any data required to initialize the persistent store."]
    pub context: *mut ::std::os::raw::c_void,
    #[doc = " A function pointer to an implementation of Persistence_open()."]
    pub popen: Persistence_open,
    #[doc = " A function pointer to an implementation of Persistence_close()."]
    pub pclose: Persistence_close,
    #[doc = " A function pointer to an implementation of Persistence_put()."]
    pub pput: Persistence_put,
    #[doc = " A function pointer to an implementation of Persistence_get()."]
    pub pget: Persistence_get,
    #[doc = " A function pointer to an implementation of Persistence_remove()."]
    pub premove: Persistence_remove,
    #[doc = " A function pointer to an implementation of Persistence_keys()."]
    pub pkeys: Persistence_keys,
    #[doc = " A function pointer to an implementation of Persistence_clear()."]
    pub pclear: Persistence_clear,
    #[doc = " A function pointer to an implementation of Persistence_containskey()."]
    pub pcontainskey: Persistence_containskey,
}
#[test]
fn bindgen_test_layout_MQTTClient_persistence() {
    assert_eq!(
        ::std::mem::size_of::<MQTTClient_persistence>(),
        72usize,
        concat!("Size of: ", stringify!(MQTTClient_persistence))
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTClient_persistence>(),
        8usize,
        concat!("Alignment of ", stringify!(MQTTClient_persistence))
    );
    fn test_field_context() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTClient_persistence>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).context) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTClient_persistence),
                "::",
                stringify!(context)
            )
        );
    }
    test_field_context();
    fn test_field_popen() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTClient_persistence>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).popen) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTClient_persistence),
                "::",
                stringify!(popen)
            )
        );
    }
    test_field_popen();
    fn test_field_pclose() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTClient_persistence>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pclose) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTClient_persistence),
                "::",
                stringify!(pclose)
            )
        );
    }
    test_field_pclose();
    fn test_field_pput() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTClient_persistence>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pput) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTClient_persistence),
                "::",
                stringify!(pput)
            )
        );
    }
    test_field_pput();
    fn test_field_pget() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTClient_persistence>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pget) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTClient_persistence),
                "::",
                stringify!(pget)
            )
        );
    }
    test_field_pget();
    fn test_field_premove() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTClient_persistence>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).premove) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTClient_persistence),
                "::",
                stringify!(premove)
            )
        );
    }
    test_field_premove();
    fn test_field_pkeys() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTClient_persistence>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pkeys) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTClient_persistence),
                "::",
                stringify!(pkeys)
            )
        );
    }
    test_field_pkeys();
    fn test_field_pclear() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTClient_persistence>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pclear) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTClient_persistence),
                "::",
                stringify!(pclear)
            )
        );
    }
    test_field_pclear();
    fn test_field_pcontainskey() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTClient_persistence>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pcontainskey) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTClient_persistence),
                "::",
                stringify!(pcontainskey)
            )
        );
    }
    test_field_pcontainskey();
}
#[doc = " A callback which is invoked just before a write to persistence.  This can be"]
#[doc = " used to transform the data, for instance to encrypt it."]
#[doc = " @param context The context as set in ::MQTTAsync_setBeforePersistenceWrite"]
#[doc = " @param bufcount The number of buffers to write to the persistence store."]
#[doc = " @param buffers An array of pointers to the data buffers."]
#[doc = " @param buflens An array of lengths of the data buffers."]
#[doc = " @return Return 0 if the function completes successfully, otherwise non 0."]
pub type MQTTPersistence_beforeWrite = ::std::option::Option<
    unsafe extern "C" fn(
        context: *mut ::std::os::raw::c_void,
        bufcount: ::std::os::raw::c_int,
        buffers: *mut *mut ::std::os::raw::c_char,
        buflens: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " A callback which is invoked just after a read from persistence.  This can be"]
#[doc = " used to transform the data, for instance to decrypt it."]
#[doc = " @param context The context as set in ::MQTTAsync_setAfterPersistenceRead"]
#[doc = " @param buffer The address of a pointer to a buffer."]
#[doc = " @param buflen The address of an int that is the length of the buffer."]
#[doc = " @return Return 0 if the function completes successfully, otherwise non 0."]
pub type MQTTPersistence_afterRead = ::std::option::Option<
    unsafe extern "C" fn(
        context: *mut ::std::os::raw::c_void,
        buffer: *mut *mut ::std::os::raw::c_char,
        buflen: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
#[doc = "  Initialization options"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MQTTAsync_init_options {
    #[doc = " The eyecatcher for this structure.  Must be MQTG."]
    pub struct_id: [::std::os::raw::c_char; 4usize],
    #[doc = " The version number of this structure.  Must be 0"]
    pub struct_version: ::std::os::raw::c_int,
    #[doc = " 1 = we do openssl init, 0 = leave it to the application"]
    pub do_openssl_init: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_MQTTAsync_init_options() {
    assert_eq!(
        ::std::mem::size_of::<MQTTAsync_init_options>(),
        12usize,
        concat!("Size of: ", stringify!(MQTTAsync_init_options))
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTAsync_init_options>(),
        4usize,
        concat!("Alignment of ", stringify!(MQTTAsync_init_options))
    );
    fn test_field_struct_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_init_options>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).struct_id) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_init_options),
                "::",
                stringify!(struct_id)
            )
        );
    }
    test_field_struct_id();
    fn test_field_struct_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_init_options>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).struct_version) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_init_options),
                "::",
                stringify!(struct_version)
            )
        );
    }
    test_field_struct_version();
    fn test_field_do_openssl_init() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_init_options>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).do_openssl_init) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_init_options),
                "::",
                stringify!(do_openssl_init)
            )
        );
    }
    test_field_do_openssl_init();
}
extern "C" {
    #[doc = " Global init of mqtt library. Call once on program start to set global behaviour."]
    #[doc = " handle_openssl_init - if mqtt library should handle openssl init (1) or rely on the caller to init it before using mqtt (0)"]
    pub fn MQTTAsync_global_init(inits: *mut MQTTAsync_init_options);
}
#[doc = " A handle representing an MQTT client. A valid client handle is available"]
#[doc = " following a successful call to MQTTAsync_create()."]
pub type MQTTAsync = *mut ::std::os::raw::c_void;
#[doc = " A value representing an MQTT message. A token is returned to the"]
#[doc = " client application when a message is published. The token can then be used to"]
#[doc = " check that the message was successfully delivered to its destination (see"]
#[doc = " MQTTAsync_publish(),"]
#[doc = " MQTTAsync_publishMessage(),"]
#[doc = " MQTTAsync_deliveryComplete(), and"]
#[doc = " MQTTAsync_getPendingTokens())."]
pub type MQTTAsync_token = ::std::os::raw::c_int;
#[doc = " A structure representing the payload and attributes of an MQTT message. The"]
#[doc = " message topic is not part of this structure (see MQTTAsync_publishMessage(),"]
#[doc = " MQTTAsync_publish(), MQTTAsync_receive(), MQTTAsync_freeMessage()"]
#[doc = " and MQTTAsync_messageArrived())."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MQTTAsync_message {
    #[doc = " The eyecatcher for this structure.  must be MQTM."]
    pub struct_id: [::std::os::raw::c_char; 4usize],
    #[doc = " The version number of this structure.  Must be 0 or 1."]
    #[doc = "  0 indicates no message properties"]
    pub struct_version: ::std::os::raw::c_int,
    #[doc = " The length of the MQTT message payload in bytes."]
    pub payloadlen: ::std::os::raw::c_int,
    #[doc = " A pointer to the payload of the MQTT message."]
    pub payload: *mut ::std::os::raw::c_void,
    #[doc = " The quality of service (QoS) assigned to the message."]
    #[doc = " There are three levels of QoS:"]
    #[doc = " <DL>"]
    #[doc = " <DT><B>QoS0</B></DT>"]
    #[doc = " <DD>Fire and forget - the message may not be delivered</DD>"]
    #[doc = " <DT><B>QoS1</B></DT>"]
    #[doc = " <DD>At least once - the message will be delivered, but may be"]
    #[doc = " delivered more than once in some circumstances.</DD>"]
    #[doc = " <DT><B>QoS2</B></DT>"]
    #[doc = " <DD>Once and one only - the message will be delivered exactly once.</DD>"]
    #[doc = " </DL>"]
    pub qos: ::std::os::raw::c_int,
    #[doc = " The retained flag serves two purposes depending on whether the message"]
    #[doc = " it is associated with is being published or received."]
    #[doc = ""]
    #[doc = " <b>retained = true</b><br>"]
    #[doc = " For messages being published, a true setting indicates that the MQTT"]
    #[doc = " server should retain a copy of the message. The message will then be"]
    #[doc = " transmitted to new subscribers to a topic that matches the message topic."]
    #[doc = " For subscribers registering a new subscription, the flag being true"]
    #[doc = " indicates that the received message is not a new one, but one that has"]
    #[doc = " been retained by the MQTT server."]
    #[doc = ""]
    #[doc = " <b>retained = false</b> <br>"]
    #[doc = " For publishers, this indicates that this message should not be retained"]
    #[doc = " by the MQTT server. For subscribers, a false setting indicates this is"]
    #[doc = " a normal message, received as a result of it being published to the"]
    #[doc = " server."]
    pub retained: ::std::os::raw::c_int,
    #[doc = " The dup flag indicates whether or not this message is a duplicate."]
    #[doc = " It is only meaningful when receiving QoS1 messages. When true, the"]
    #[doc = " client application should take appropriate action to deal with the"]
    #[doc = " duplicate message.  This is an output parameter only."]
    pub dup: ::std::os::raw::c_int,
    #[doc = " The message identifier is reserved for internal use by the"]
    #[doc = " MQTT client and server.  It is an output parameter only - writing"]
    #[doc = " to it will serve no purpose.  It contains the MQTT message id of"]
    #[doc = " an incoming publish message."]
    pub msgid: ::std::os::raw::c_int,
    #[doc = " The MQTT V5 properties associated with the message."]
    pub properties: MQTTProperties,
}
#[test]
fn bindgen_test_layout_MQTTAsync_message() {
    assert_eq!(
        ::std::mem::size_of::<MQTTAsync_message>(),
        64usize,
        concat!("Size of: ", stringify!(MQTTAsync_message))
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTAsync_message>(),
        8usize,
        concat!("Alignment of ", stringify!(MQTTAsync_message))
    );
    fn test_field_struct_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_message>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).struct_id) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_message),
                "::",
                stringify!(struct_id)
            )
        );
    }
    test_field_struct_id();
    fn test_field_struct_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_message>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).struct_version) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_message),
                "::",
                stringify!(struct_version)
            )
        );
    }
    test_field_struct_version();
    fn test_field_payloadlen() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_message>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).payloadlen) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_message),
                "::",
                stringify!(payloadlen)
            )
        );
    }
    test_field_payloadlen();
    fn test_field_payload() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_message>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).payload) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_message),
                "::",
                stringify!(payload)
            )
        );
    }
    test_field_payload();
    fn test_field_qos() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_message>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).qos) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_message),
                "::",
                stringify!(qos)
            )
        );
    }
    test_field_qos();
    fn test_field_retained() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_message>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).retained) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_message),
                "::",
                stringify!(retained)
            )
        );
    }
    test_field_retained();
    fn test_field_dup() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_message>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dup) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_message),
                "::",
                stringify!(dup)
            )
        );
    }
    test_field_dup();
    fn test_field_msgid() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_message>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).msgid) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_message),
                "::",
                stringify!(msgid)
            )
        );
    }
    test_field_msgid();
    fn test_field_properties() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_message>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).properties) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_message),
                "::",
                stringify!(properties)
            )
        );
    }
    test_field_properties();
}
#[doc = " This is a callback function. The client application"]
#[doc = " must provide an implementation of this function to enable asynchronous"]
#[doc = " receipt of messages. The function is registered with the client library by"]
#[doc = " passing it as an argument to MQTTAsync_setCallbacks(). It is"]
#[doc = " called by the client library when a new message that matches a client"]
#[doc = " subscription has been received from the server. This function is executed on"]
#[doc = " a separate thread to the one on which the client application is running."]
#[doc = ""]
#[doc = " <b>Note:</b> Neither MQTTAsync_create() nor MQTTAsync_destroy() should be"]
#[doc = " called within this callback."]
#[doc = " @param context A pointer to the <i>context</i> value originally passed to"]
#[doc = " MQTTAsync_setCallbacks(), which contains any application-specific context."]
#[doc = " @param topicName The topic associated with the received message."]
#[doc = " @param topicLen The length of the topic if there are one"]
#[doc = " more NULL characters embedded in <i>topicName</i>, otherwise <i>topicLen</i>"]
#[doc = " is 0. If <i>topicLen</i> is 0, the value returned by <i>strlen(topicName)</i>"]
#[doc = " can be trusted. If <i>topicLen</i> is greater than 0, the full topic name"]
#[doc = " can be retrieved by accessing <i>topicName</i> as a byte array of length"]
#[doc = " <i>topicLen</i>."]
#[doc = " @param message The MQTTAsync_message structure for the received message."]
#[doc = " This structure contains the message payload and attributes."]
#[doc = " @return This function must return 0 or 1 indicating whether or not"]
#[doc = " the message has been safely received by the client application. <br>"]
#[doc = " Returning 1 indicates that the message has been successfully handled."]
#[doc = " To free the message storage, ::MQTTAsync_freeMessage must be called."]
#[doc = " To free the topic name storage, ::MQTTAsync_free must be called.<br>"]
#[doc = " Returning 0 indicates that there was a problem. In this"]
#[doc = " case, the client library will reinvoke MQTTAsync_messageArrived() to"]
#[doc = " attempt to deliver the message to the application again."]
#[doc = " Do not free the message and topic storage when returning 0, otherwise"]
#[doc = " the redelivery will fail."]
pub type MQTTAsync_messageArrived = ::std::option::Option<
    unsafe extern "C" fn(
        context: *mut ::std::os::raw::c_void,
        topicName: *mut ::std::os::raw::c_char,
        topicLen: ::std::os::raw::c_int,
        message: *mut MQTTAsync_message,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " This is a callback function. The client application"]
#[doc = " must provide an implementation of this function to enable asynchronous"]
#[doc = " notification of delivery of messages to the server. The function is"]
#[doc = " registered with the client library by passing it as an argument to MQTTAsync_setCallbacks()."]
#[doc = " It is called by the client library after the client application has"]
#[doc = " published a message to the server. It indicates that the necessary"]
#[doc = " handshaking and acknowledgements for the requested quality of service (see"]
#[doc = " MQTTAsync_message.qos) have been completed. This function is executed on a"]
#[doc = " separate thread to the one on which the client application is running."]
#[doc = ""]
#[doc = " <b>Note:</b> Neither MQTTAsync_create() nor MQTTAsync_destroy() should be"]
#[doc = " called within this callback."]
#[doc = " @param context A pointer to the <i>context</i> value originally passed to"]
#[doc = " MQTTAsync_setCallbacks(), which contains any application-specific context."]
#[doc = " @param token The ::MQTTAsync_token associated with"]
#[doc = " the published message. Applications can check that all messages have been"]
#[doc = " correctly published by matching the tokens returned from calls to"]
#[doc = " MQTTAsync_send() and MQTTAsync_sendMessage() with the tokens passed"]
#[doc = " to this callback."]
pub type MQTTAsync_deliveryComplete = ::std::option::Option<
    unsafe extern "C" fn(context: *mut ::std::os::raw::c_void, token: MQTTAsync_token),
>;
#[doc = " This is a callback function. The client application"]
#[doc = " must provide an implementation of this function to enable asynchronous"]
#[doc = " notification of the loss of connection to the server. The function is"]
#[doc = " registered with the client library by passing it as an argument to"]
#[doc = " MQTTAsync_setCallbacks(). It is called by the client library if the client"]
#[doc = " loses its connection to the server. The client application must take"]
#[doc = " appropriate action, such as trying to reconnect or reporting the problem."]
#[doc = " This function is executed on a separate thread to the one on which the"]
#[doc = " client application is running."]
#[doc = ""]
#[doc = " <b>Note:</b> Neither MQTTAsync_create() nor MQTTAsync_destroy() should be"]
#[doc = " called within this callback."]
#[doc = " @param context A pointer to the <i>context</i> value originally passed to"]
#[doc = " MQTTAsync_setCallbacks(), which contains any application-specific context."]
#[doc = " @param cause The reason for the disconnection."]
#[doc = " Currently, <i>cause</i> is always set to NULL."]
pub type MQTTAsync_connectionLost = ::std::option::Option<
    unsafe extern "C" fn(context: *mut ::std::os::raw::c_void, cause: *mut ::std::os::raw::c_char),
>;
#[doc = " This is a callback function, which will be called when the client"]
#[doc = " library successfully connects.  This is superfluous when the connection"]
#[doc = " is made in response to a MQTTAsync_connect call, because the onSuccess"]
#[doc = " callback can be used.  It is intended for use when automatic reconnect"]
#[doc = " is enabled, so that when a reconnection attempt succeeds in the background,"]
#[doc = " the application is notified and can take any required actions."]
#[doc = ""]
#[doc = " <b>Note:</b> Neither MQTTAsync_create() nor MQTTAsync_destroy() should be"]
#[doc = " called within this callback."]
#[doc = " @param context A pointer to the <i>context</i> value originally passed to"]
#[doc = " MQTTAsync_setCallbacks(), which contains any application-specific context."]
#[doc = " @param cause The reason for the disconnection."]
#[doc = " Currently, <i>cause</i> is always set to NULL."]
pub type MQTTAsync_connected = ::std::option::Option<
    unsafe extern "C" fn(context: *mut ::std::os::raw::c_void, cause: *mut ::std::os::raw::c_char),
>;
#[doc = " This is a callback function, which will be called when the client"]
#[doc = " library receives a disconnect packet from the server. This applies to MQTT V5 and above only."]
#[doc = ""]
#[doc = " <b>Note:</b> Neither MQTTAsync_create() nor MQTTAsync_destroy() should be"]
#[doc = " called within this callback."]
#[doc = " @param context A pointer to the <i>context</i> value originally passed to"]
#[doc = " MQTTAsync_setCallbacks(), which contains any application-specific context."]
#[doc = " @param properties the properties in the disconnect packet."]
#[doc = " @param properties the reason code from the disconnect packet"]
#[doc = " Currently, <i>cause</i> is always set to NULL."]
pub type MQTTAsync_disconnected = ::std::option::Option<
    unsafe extern "C" fn(
        context: *mut ::std::os::raw::c_void,
        properties: *mut MQTTProperties,
        reasonCode: MQTTReasonCodes,
    ),
>;
extern "C" {
    #[doc = " Sets the MQTTAsync_disconnected() callback function for a client."]
    #[doc = " @param handle A valid client handle from a successful call to"]
    #[doc = " MQTTAsync_create()."]
    #[doc = ""]
    #[doc = " <b>Note:</b> Neither MQTTAsync_create() nor MQTTAsync_destroy() should be"]
    #[doc = " called within this callback."]
    #[doc = " @param context A pointer to any application-specific context. The"]
    #[doc = " the <i>context</i> pointer is passed to each of the callback functions to"]
    #[doc = " provide access to the context information in the callback."]
    #[doc = " @param co A pointer to an MQTTAsync_connected() callback"]
    #[doc = " function.  NULL removes the callback setting."]
    #[doc = " @return ::MQTTASYNC_SUCCESS if the callbacks were correctly set,"]
    #[doc = " ::MQTTASYNC_FAILURE if an error occurred."]
    pub fn MQTTAsync_setDisconnected(
        handle: MQTTAsync,
        context: *mut ::std::os::raw::c_void,
        co: MQTTAsync_disconnected,
    ) -> ::std::os::raw::c_int;
}
#[doc = " The connect options that can be updated before an automatic reconnect."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MQTTAsync_connectData {
    #[doc = " The eyecatcher for this structure.  Will be MQCD."]
    pub struct_id: [::std::os::raw::c_char; 4usize],
    #[doc = " The version number of this structure.  Will be 0"]
    pub struct_version: ::std::os::raw::c_int,
    #[doc = " MQTT servers that support the MQTT v3.1 protocol provide authentication"]
    #[doc = " and authorisation by user name and password. This is the user name parameter."]
    #[doc = " Set data to NULL to remove.  To change, allocate new"]
    #[doc = " storage with ::MQTTAsync_allocate - this will then be free later by the library."]
    pub username: *const ::std::os::raw::c_char,
    pub binarypwd: MQTTAsync_connectData__bindgen_ty_1,
}
#[doc = " The password parameter of the MQTT authentication."]
#[doc = " Set data to NULL to remove.  To change, allocate new"]
#[doc = " storage with ::MQTTAsync_allocate - this will then be free later by the library."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MQTTAsync_connectData__bindgen_ty_1 {
    #[doc = "< binary password length"]
    pub len: ::std::os::raw::c_int,
    #[doc = "< binary password data"]
    pub data: *const ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_MQTTAsync_connectData__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<MQTTAsync_connectData__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(MQTTAsync_connectData__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTAsync_connectData__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(MQTTAsync_connectData__bindgen_ty_1)
        )
    );
    fn test_field_len() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<MQTTAsync_connectData__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectData__bindgen_ty_1),
                "::",
                stringify!(len)
            )
        );
    }
    test_field_len();
    fn test_field_data() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<MQTTAsync_connectData__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectData__bindgen_ty_1),
                "::",
                stringify!(data)
            )
        );
    }
    test_field_data();
}
#[test]
fn bindgen_test_layout_MQTTAsync_connectData() {
    assert_eq!(
        ::std::mem::size_of::<MQTTAsync_connectData>(),
        32usize,
        concat!("Size of: ", stringify!(MQTTAsync_connectData))
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTAsync_connectData>(),
        8usize,
        concat!("Alignment of ", stringify!(MQTTAsync_connectData))
    );
    fn test_field_struct_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).struct_id) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectData),
                "::",
                stringify!(struct_id)
            )
        );
    }
    test_field_struct_id();
    fn test_field_struct_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).struct_version) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectData),
                "::",
                stringify!(struct_version)
            )
        );
    }
    test_field_struct_version();
    fn test_field_username() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).username) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectData),
                "::",
                stringify!(username)
            )
        );
    }
    test_field_username();
    fn test_field_binarypwd() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).binarypwd) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectData),
                "::",
                stringify!(binarypwd)
            )
        );
    }
    test_field_binarypwd();
}
#[doc = " This is a callback function which will allow the client application to update the"]
#[doc = " connection data."]
#[doc = " @param data The connection data which can be modified by the application."]
#[doc = " @return Return a non-zero value to update the connect data, zero to keep the same data."]
pub type MQTTAsync_updateConnectOptions = ::std::option::Option<
    unsafe extern "C" fn(
        context: *mut ::std::os::raw::c_void,
        data: *mut MQTTAsync_connectData,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    #[doc = " Sets the MQTTAsync_updateConnectOptions() callback function for a client."]
    #[doc = " @param handle A valid client handle from a successful call to MQTTAsync_create()."]
    #[doc = " @param context A pointer to any application-specific context. The"]
    #[doc = " the <i>context</i> pointer is passed to each of the callback functions to"]
    #[doc = " provide access to the context information in the callback."]
    #[doc = " @param co A pointer to an MQTTAsync_updateConnectOptions() callback"]
    #[doc = " function.  NULL removes the callback setting."]
    pub fn MQTTAsync_setUpdateConnectOptions(
        handle: MQTTAsync,
        context: *mut ::std::os::raw::c_void,
        co: MQTTAsync_updateConnectOptions,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Sets the MQTTPersistence_beforeWrite() callback function for a client."]
    #[doc = " @param handle A valid client handle from a successful call to MQTTAsync_create()."]
    #[doc = " @param context A pointer to any application-specific context. The"]
    #[doc = " the <i>context</i> pointer is passed to the callback function to"]
    #[doc = " provide access to the context information in the callback."]
    #[doc = " @param co A pointer to an MQTTPersistence_beforeWrite() callback"]
    #[doc = " function.  NULL removes the callback setting."]
    pub fn MQTTAsync_setBeforePersistenceWrite(
        handle: MQTTAsync,
        context: *mut ::std::os::raw::c_void,
        co: MQTTPersistence_beforeWrite,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Sets the MQTTPersistence_afterRead() callback function for a client."]
    #[doc = " @param handle A valid client handle from a successful call to MQTTAsync_create()."]
    #[doc = " @param context A pointer to any application-specific context. The"]
    #[doc = " the <i>context</i> pointer is passed to the callback function to"]
    #[doc = " provide access to the context information in the callback."]
    #[doc = " @param co A pointer to an MQTTPersistence_beforeWrite() callback"]
    #[doc = " function.  NULL removes the callback setting."]
    pub fn MQTTAsync_setAfterPersistenceRead(
        handle: MQTTAsync,
        context: *mut ::std::os::raw::c_void,
        co: MQTTPersistence_afterRead,
    ) -> ::std::os::raw::c_int;
}
#[doc = " The data returned on completion of an unsuccessful API call in the response callback onFailure."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MQTTAsync_failureData {
    #[doc = " A token identifying the failed request."]
    pub token: MQTTAsync_token,
    #[doc = " A numeric code identifying the error."]
    pub code: ::std::os::raw::c_int,
    #[doc = " Optional text explaining the error. Can be NULL."]
    pub message: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_MQTTAsync_failureData() {
    assert_eq!(
        ::std::mem::size_of::<MQTTAsync_failureData>(),
        16usize,
        concat!("Size of: ", stringify!(MQTTAsync_failureData))
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTAsync_failureData>(),
        8usize,
        concat!("Alignment of ", stringify!(MQTTAsync_failureData))
    );
    fn test_field_token() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_failureData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_failureData),
                "::",
                stringify!(token)
            )
        );
    }
    test_field_token();
    fn test_field_code() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_failureData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).code) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_failureData),
                "::",
                stringify!(code)
            )
        );
    }
    test_field_code();
    fn test_field_message() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_failureData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).message) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_failureData),
                "::",
                stringify!(message)
            )
        );
    }
    test_field_message();
}
#[doc = " The data returned on completion of an unsuccessful API call in the response callback onFailure."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MQTTAsync_failureData5 {
    #[doc = " The eyecatcher for this structure.  Will be MQFD."]
    pub struct_id: [::std::os::raw::c_char; 4usize],
    #[doc = " The version number of this structure.  Will be 0"]
    pub struct_version: ::std::os::raw::c_int,
    #[doc = " A token identifying the failed request."]
    pub token: MQTTAsync_token,
    #[doc = " The MQTT reason code returned."]
    pub reasonCode: MQTTReasonCodes,
    #[doc = " The MQTT properties on the ack, if any."]
    pub properties: MQTTProperties,
    #[doc = " A numeric code identifying the MQTT client library error."]
    pub code: ::std::os::raw::c_int,
    #[doc = " Optional further text explaining the error. Can be NULL."]
    pub message: *const ::std::os::raw::c_char,
    #[doc = " Packet type on which the failure occurred - used for publish QoS 1/2 exchanges"]
    pub packet_type: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_MQTTAsync_failureData5() {
    assert_eq!(
        ::std::mem::size_of::<MQTTAsync_failureData5>(),
        64usize,
        concat!("Size of: ", stringify!(MQTTAsync_failureData5))
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTAsync_failureData5>(),
        8usize,
        concat!("Alignment of ", stringify!(MQTTAsync_failureData5))
    );
    fn test_field_struct_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_failureData5>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).struct_id) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_failureData5),
                "::",
                stringify!(struct_id)
            )
        );
    }
    test_field_struct_id();
    fn test_field_struct_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_failureData5>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).struct_version) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_failureData5),
                "::",
                stringify!(struct_version)
            )
        );
    }
    test_field_struct_version();
    fn test_field_token() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_failureData5>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_failureData5),
                "::",
                stringify!(token)
            )
        );
    }
    test_field_token();
    fn test_field_reasonCode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_failureData5>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).reasonCode) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_failureData5),
                "::",
                stringify!(reasonCode)
            )
        );
    }
    test_field_reasonCode();
    fn test_field_properties() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_failureData5>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).properties) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_failureData5),
                "::",
                stringify!(properties)
            )
        );
    }
    test_field_properties();
    fn test_field_code() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_failureData5>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).code) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_failureData5),
                "::",
                stringify!(code)
            )
        );
    }
    test_field_code();
    fn test_field_message() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_failureData5>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).message) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_failureData5),
                "::",
                stringify!(message)
            )
        );
    }
    test_field_message();
    fn test_field_packet_type() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_failureData5>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).packet_type) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_failureData5),
                "::",
                stringify!(packet_type)
            )
        );
    }
    test_field_packet_type();
}
#[doc = " The data returned on completion of a successful API call in the response callback onSuccess."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct MQTTAsync_successData {
    #[doc = " A token identifying the successful request. Can be used to refer to the request later."]
    pub token: MQTTAsync_token,
    pub alt: MQTTAsync_successData__bindgen_ty_1,
}
#[doc = " A union of the different values that can be returned for subscribe, unsubscribe and publish."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union MQTTAsync_successData__bindgen_ty_1 {
    #[doc = " For subscribe, the granted QoS of the subscription returned by the server."]
    #[doc = " Also for subscribeMany, if only 1 subscription was requested."]
    pub qos: ::std::os::raw::c_int,
    #[doc = " For subscribeMany, if more than one subscription was requested,"]
    #[doc = " the list of granted QoSs of the subscriptions returned by the server."]
    pub qosList: *mut ::std::os::raw::c_int,
    pub pub_: MQTTAsync_successData__bindgen_ty_1__bindgen_ty_1,
    pub connect: MQTTAsync_successData__bindgen_ty_1__bindgen_ty_2,
}
#[doc = " For publish, the message being sent to the server."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MQTTAsync_successData__bindgen_ty_1__bindgen_ty_1 {
    #[doc = "< the message being sent to the server"]
    pub message: MQTTAsync_message,
    #[doc = "< the topic destination for the message"]
    pub destinationName: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_MQTTAsync_successData__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<MQTTAsync_successData__bindgen_ty_1__bindgen_ty_1>(),
        72usize,
        concat!(
            "Size of: ",
            stringify!(MQTTAsync_successData__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTAsync_successData__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(MQTTAsync_successData__bindgen_ty_1__bindgen_ty_1)
        )
    );
    fn test_field_message() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    MQTTAsync_successData__bindgen_ty_1__bindgen_ty_1,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).message) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData__bindgen_ty_1__bindgen_ty_1),
                "::",
                stringify!(message)
            )
        );
    }
    test_field_message();
    fn test_field_destinationName() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    MQTTAsync_successData__bindgen_ty_1__bindgen_ty_1,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).destinationName) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData__bindgen_ty_1__bindgen_ty_1),
                "::",
                stringify!(destinationName)
            )
        );
    }
    test_field_destinationName();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MQTTAsync_successData__bindgen_ty_1__bindgen_ty_2 {
    #[doc = "< the connection string of the server"]
    pub serverURI: *mut ::std::os::raw::c_char,
    #[doc = "< the version of MQTT being used"]
    pub MQTTVersion: ::std::os::raw::c_int,
    #[doc = "< the session present flag returned from the server"]
    pub sessionPresent: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_MQTTAsync_successData__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<MQTTAsync_successData__bindgen_ty_1__bindgen_ty_2>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(MQTTAsync_successData__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTAsync_successData__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(MQTTAsync_successData__bindgen_ty_1__bindgen_ty_2)
        )
    );
    fn test_field_serverURI() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    MQTTAsync_successData__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).serverURI) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(serverURI)
            )
        );
    }
    test_field_serverURI();
    fn test_field_MQTTVersion() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    MQTTAsync_successData__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MQTTVersion) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(MQTTVersion)
            )
        );
    }
    test_field_MQTTVersion();
    fn test_field_sessionPresent() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    MQTTAsync_successData__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sessionPresent) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(sessionPresent)
            )
        );
    }
    test_field_sessionPresent();
}
#[test]
fn bindgen_test_layout_MQTTAsync_successData__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<MQTTAsync_successData__bindgen_ty_1>(),
        72usize,
        concat!("Size of: ", stringify!(MQTTAsync_successData__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTAsync_successData__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(MQTTAsync_successData__bindgen_ty_1)
        )
    );
    fn test_field_qos() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<MQTTAsync_successData__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).qos) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData__bindgen_ty_1),
                "::",
                stringify!(qos)
            )
        );
    }
    test_field_qos();
    fn test_field_qosList() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<MQTTAsync_successData__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).qosList) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData__bindgen_ty_1),
                "::",
                stringify!(qosList)
            )
        );
    }
    test_field_qosList();
    fn test_field_pub() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<MQTTAsync_successData__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pub_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData__bindgen_ty_1),
                "::",
                stringify!(pub_)
            )
        );
    }
    test_field_pub();
    fn test_field_connect() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<MQTTAsync_successData__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).connect) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData__bindgen_ty_1),
                "::",
                stringify!(connect)
            )
        );
    }
    test_field_connect();
}
#[test]
fn bindgen_test_layout_MQTTAsync_successData() {
    assert_eq!(
        ::std::mem::size_of::<MQTTAsync_successData>(),
        80usize,
        concat!("Size of: ", stringify!(MQTTAsync_successData))
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTAsync_successData>(),
        8usize,
        concat!("Alignment of ", stringify!(MQTTAsync_successData))
    );
    fn test_field_token() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_successData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData),
                "::",
                stringify!(token)
            )
        );
    }
    test_field_token();
    fn test_field_alt() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_successData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).alt) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData),
                "::",
                stringify!(alt)
            )
        );
    }
    test_field_alt();
}
#[doc = " The data returned on completion of a successful API call in the response callback onSuccess."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct MQTTAsync_successData5 {
    #[doc = "< The eyecatcher for this structure.  Will be MQSD."]
    pub struct_id: [::std::os::raw::c_char; 4usize],
    #[doc = "< The version number of this structure.  Will be 0"]
    pub struct_version: ::std::os::raw::c_int,
    #[doc = " A token identifying the successful request. Can be used to refer to the request later."]
    pub token: MQTTAsync_token,
    #[doc = "< MQTT V5 reason code returned"]
    pub reasonCode: MQTTReasonCodes,
    #[doc = "< MQTT V5 properties returned, if any"]
    pub properties: MQTTProperties,
    pub alt: MQTTAsync_successData5__bindgen_ty_1,
}
#[doc = " A union of the different values that can be returned for subscribe, unsubscribe and publish."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union MQTTAsync_successData5__bindgen_ty_1 {
    pub sub: MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_1,
    pub pub_: MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_2,
    pub connect: MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_3,
    pub unsub: MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_4,
}
#[doc = " For subscribeMany, the list of reasonCodes returned by the server."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_1 {
    #[doc = "< the number of reason codes in the reasonCodes array"]
    pub reasonCodeCount: ::std::os::raw::c_int,
    #[doc = "< an array of reasonCodes"]
    pub reasonCodes: *mut MQTTReasonCodes,
}
#[test]
fn bindgen_test_layout_MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_1)
        )
    );
    fn test_field_reasonCodeCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_1,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).reasonCodeCount) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_1),
                "::",
                stringify!(reasonCodeCount)
            )
        );
    }
    test_field_reasonCodeCount();
    fn test_field_reasonCodes() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_1,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).reasonCodes) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_1),
                "::",
                stringify!(reasonCodes)
            )
        );
    }
    test_field_reasonCodes();
}
#[doc = " For publish, the message being sent to the server."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_2 {
    #[doc = "< the message being sent to the server"]
    pub message: MQTTAsync_message,
    #[doc = "< the topic destination for the message"]
    pub destinationName: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_2>(),
        72usize,
        concat!(
            "Size of: ",
            stringify!(MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_2)
        )
    );
    fn test_field_message() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).message) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(message)
            )
        );
    }
    test_field_message();
    fn test_field_destinationName() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).destinationName) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(destinationName)
            )
        );
    }
    test_field_destinationName();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_3 {
    #[doc = "< the connection string of the server"]
    pub serverURI: *mut ::std::os::raw::c_char,
    #[doc = "< the version of MQTT being used"]
    pub MQTTVersion: ::std::os::raw::c_int,
    #[doc = "< the session present flag returned from the server"]
    pub sessionPresent: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_3>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_3>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_3)
        )
    );
    fn test_field_serverURI() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_3,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).serverURI) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_3),
                "::",
                stringify!(serverURI)
            )
        );
    }
    test_field_serverURI();
    fn test_field_MQTTVersion() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_3,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MQTTVersion) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_3),
                "::",
                stringify!(MQTTVersion)
            )
        );
    }
    test_field_MQTTVersion();
    fn test_field_sessionPresent() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_3,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sessionPresent) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_3),
                "::",
                stringify!(sessionPresent)
            )
        );
    }
    test_field_sessionPresent();
}
#[doc = " For unsubscribeMany, the list of reasonCodes returned by the server."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_4 {
    #[doc = "< the number of reason codes in the reasonCodes array"]
    pub reasonCodeCount: ::std::os::raw::c_int,
    #[doc = "< an array of reasonCodes"]
    pub reasonCodes: *mut MQTTReasonCodes,
}
#[test]
fn bindgen_test_layout_MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_4() {
    assert_eq!(
        ::std::mem::size_of::<MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_4>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_4)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_4>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_4)
        )
    );
    fn test_field_reasonCodeCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_4,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).reasonCodeCount) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_4),
                "::",
                stringify!(reasonCodeCount)
            )
        );
    }
    test_field_reasonCodeCount();
    fn test_field_reasonCodes() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_4,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).reasonCodes) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData5__bindgen_ty_1__bindgen_ty_4),
                "::",
                stringify!(reasonCodes)
            )
        );
    }
    test_field_reasonCodes();
}
#[test]
fn bindgen_test_layout_MQTTAsync_successData5__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<MQTTAsync_successData5__bindgen_ty_1>(),
        72usize,
        concat!(
            "Size of: ",
            stringify!(MQTTAsync_successData5__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTAsync_successData5__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(MQTTAsync_successData5__bindgen_ty_1)
        )
    );
    fn test_field_sub() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<MQTTAsync_successData5__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sub) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData5__bindgen_ty_1),
                "::",
                stringify!(sub)
            )
        );
    }
    test_field_sub();
    fn test_field_pub() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<MQTTAsync_successData5__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pub_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData5__bindgen_ty_1),
                "::",
                stringify!(pub_)
            )
        );
    }
    test_field_pub();
    fn test_field_connect() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<MQTTAsync_successData5__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).connect) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData5__bindgen_ty_1),
                "::",
                stringify!(connect)
            )
        );
    }
    test_field_connect();
    fn test_field_unsub() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<MQTTAsync_successData5__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unsub) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData5__bindgen_ty_1),
                "::",
                stringify!(unsub)
            )
        );
    }
    test_field_unsub();
}
#[test]
fn bindgen_test_layout_MQTTAsync_successData5() {
    assert_eq!(
        ::std::mem::size_of::<MQTTAsync_successData5>(),
        112usize,
        concat!("Size of: ", stringify!(MQTTAsync_successData5))
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTAsync_successData5>(),
        8usize,
        concat!("Alignment of ", stringify!(MQTTAsync_successData5))
    );
    fn test_field_struct_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_successData5>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).struct_id) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData5),
                "::",
                stringify!(struct_id)
            )
        );
    }
    test_field_struct_id();
    fn test_field_struct_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_successData5>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).struct_version) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData5),
                "::",
                stringify!(struct_version)
            )
        );
    }
    test_field_struct_version();
    fn test_field_token() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_successData5>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData5),
                "::",
                stringify!(token)
            )
        );
    }
    test_field_token();
    fn test_field_reasonCode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_successData5>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).reasonCode) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData5),
                "::",
                stringify!(reasonCode)
            )
        );
    }
    test_field_reasonCode();
    fn test_field_properties() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_successData5>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).properties) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData5),
                "::",
                stringify!(properties)
            )
        );
    }
    test_field_properties();
    fn test_field_alt() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_successData5>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).alt) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_successData5),
                "::",
                stringify!(alt)
            )
        );
    }
    test_field_alt();
}
#[doc = " This is a callback function. The client application"]
#[doc = " must provide an implementation of this function to enable asynchronous"]
#[doc = " notification of the successful completion of an API call. The function is"]
#[doc = " registered with the client library by passing it as an argument in"]
#[doc = " ::MQTTAsync_responseOptions."]
#[doc = ""]
#[doc = " <b>Note:</b> Neither MQTTAsync_create() nor MQTTAsync_destroy() should be"]
#[doc = " called within this callback."]
#[doc = " @param context A pointer to the <i>context</i> value originally passed to"]
#[doc = " ::MQTTAsync_responseOptions, which contains any application-specific context."]
#[doc = " @param response Any success data associated with the API completion."]
pub type MQTTAsync_onSuccess = ::std::option::Option<
    unsafe extern "C" fn(
        context: *mut ::std::os::raw::c_void,
        response: *mut MQTTAsync_successData,
    ),
>;
#[doc = " This is a callback function, the MQTT V5 version of ::MQTTAsync_onSuccess."]
#[doc = " The client application"]
#[doc = " must provide an implementation of this function to enable asynchronous"]
#[doc = " notification of the successful completion of an API call. The function is"]
#[doc = " registered with the client library by passing it as an argument in"]
#[doc = " ::MQTTAsync_responseOptions."]
#[doc = ""]
#[doc = " <b>Note:</b> Neither MQTTAsync_create() nor MQTTAsync_destroy() should be"]
#[doc = " called within this callback."]
#[doc = " @param context A pointer to the <i>context</i> value originally passed to"]
#[doc = " ::MQTTAsync_responseOptions, which contains any application-specific context."]
#[doc = " @param response Any success data associated with the API completion."]
pub type MQTTAsync_onSuccess5 = ::std::option::Option<
    unsafe extern "C" fn(
        context: *mut ::std::os::raw::c_void,
        response: *mut MQTTAsync_successData5,
    ),
>;
#[doc = " This is a callback function. The client application"]
#[doc = " must provide an implementation of this function to enable asynchronous"]
#[doc = " notification of the unsuccessful completion of an API call. The function is"]
#[doc = " registered with the client library by passing it as an argument in"]
#[doc = " ::MQTTAsync_responseOptions."]
#[doc = ""]
#[doc = " <b>Note:</b> Neither MQTTAsync_create() nor MQTTAsync_destroy() should be"]
#[doc = " called within this callback."]
#[doc = " @param context A pointer to the <i>context</i> value originally passed to"]
#[doc = " ::MQTTAsync_responseOptions, which contains any application-specific context."]
#[doc = " @param response Failure data associated with the API completion."]
pub type MQTTAsync_onFailure = ::std::option::Option<
    unsafe extern "C" fn(
        context: *mut ::std::os::raw::c_void,
        response: *mut MQTTAsync_failureData,
    ),
>;
#[doc = " This is a callback function, the MQTT V5 version of ::MQTTAsync_onFailure."]
#[doc = " The application must provide an implementation of this function to enable asynchronous"]
#[doc = " notification of the unsuccessful completion of an API call. The function is"]
#[doc = " registered with the client library by passing it as an argument in"]
#[doc = " ::MQTTAsync_responseOptions."]
#[doc = ""]
#[doc = " <b>Note:</b> Neither MQTTAsync_create() nor MQTTAsync_destroy() should be"]
#[doc = " called within this callback."]
#[doc = " @param context A pointer to the <i>context</i> value originally passed to"]
#[doc = " ::MQTTAsync_responseOptions, which contains any application-specific context."]
#[doc = " @param response Failure data associated with the API completion."]
pub type MQTTAsync_onFailure5 = ::std::option::Option<
    unsafe extern "C" fn(
        context: *mut ::std::os::raw::c_void,
        response: *mut MQTTAsync_failureData5,
    ),
>;
#[doc = " Structure to define call options.  For MQTT 5.0 there is input data as well as that"]
#[doc = " describing the response method.  So there is now also a synonym ::MQTTAsync_callOptions"]
#[doc = " to better reflect the use.  This responseOptions name is kept for backward"]
#[doc = " compatibility."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MQTTAsync_responseOptions {
    #[doc = " The eyecatcher for this structure.  Must be MQTR"]
    pub struct_id: [::std::os::raw::c_char; 4usize],
    #[doc = " The version number of this structure.  Must be 0 or 1"]
    #[doc = "   if 0, no MQTTV5 options"]
    pub struct_version: ::std::os::raw::c_int,
    #[doc = " A pointer to a callback function to be called if the API call successfully"]
    #[doc = " completes.  Can be set to NULL, in which case no indication of successful"]
    #[doc = " completion will be received."]
    pub onSuccess: MQTTAsync_onSuccess,
    #[doc = " A pointer to a callback function to be called if the API call fails."]
    #[doc = " Can be set to NULL, in which case no indication of unsuccessful"]
    #[doc = " completion will be received."]
    pub onFailure: MQTTAsync_onFailure,
    #[doc = " A pointer to any application-specific context. The"]
    #[doc = " the <i>context</i> pointer is passed to success or failure callback functions to"]
    #[doc = " provide access to the context information in the callback."]
    pub context: *mut ::std::os::raw::c_void,
    #[doc = " A token is returned from the call.  It can be used to track"]
    #[doc = " the state of this request, both in the callbacks and in future calls"]
    #[doc = " such as ::MQTTAsync_waitForCompletion. This is output only - any"]
    #[doc = " change by the application will be ignored."]
    pub token: MQTTAsync_token,
    #[doc = " A pointer to a callback function to be called if the API call successfully"]
    #[doc = " completes.  Can be set to NULL, in which case no indication of successful"]
    #[doc = " completion will be received."]
    pub onSuccess5: MQTTAsync_onSuccess5,
    #[doc = " A pointer to a callback function to be called if the API call successfully"]
    #[doc = " completes.  Can be set to NULL, in which case no indication of successful"]
    #[doc = " completion will be received."]
    pub onFailure5: MQTTAsync_onFailure5,
    #[doc = " MQTT V5 input properties"]
    pub properties: MQTTProperties,
    pub subscribeOptions: MQTTSubscribe_options,
    pub subscribeOptionsCount: ::std::os::raw::c_int,
    pub subscribeOptionsList: *mut MQTTSubscribe_options,
}
#[test]
fn bindgen_test_layout_MQTTAsync_responseOptions() {
    assert_eq!(
        ::std::mem::size_of::<MQTTAsync_responseOptions>(),
        104usize,
        concat!("Size of: ", stringify!(MQTTAsync_responseOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTAsync_responseOptions>(),
        8usize,
        concat!("Alignment of ", stringify!(MQTTAsync_responseOptions))
    );
    fn test_field_struct_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_responseOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).struct_id) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_responseOptions),
                "::",
                stringify!(struct_id)
            )
        );
    }
    test_field_struct_id();
    fn test_field_struct_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_responseOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).struct_version) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_responseOptions),
                "::",
                stringify!(struct_version)
            )
        );
    }
    test_field_struct_version();
    fn test_field_onSuccess() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_responseOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).onSuccess) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_responseOptions),
                "::",
                stringify!(onSuccess)
            )
        );
    }
    test_field_onSuccess();
    fn test_field_onFailure() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_responseOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).onFailure) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_responseOptions),
                "::",
                stringify!(onFailure)
            )
        );
    }
    test_field_onFailure();
    fn test_field_context() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_responseOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).context) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_responseOptions),
                "::",
                stringify!(context)
            )
        );
    }
    test_field_context();
    fn test_field_token() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_responseOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_responseOptions),
                "::",
                stringify!(token)
            )
        );
    }
    test_field_token();
    fn test_field_onSuccess5() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_responseOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).onSuccess5) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_responseOptions),
                "::",
                stringify!(onSuccess5)
            )
        );
    }
    test_field_onSuccess5();
    fn test_field_onFailure5() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_responseOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).onFailure5) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_responseOptions),
                "::",
                stringify!(onFailure5)
            )
        );
    }
    test_field_onFailure5();
    fn test_field_properties() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_responseOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).properties) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_responseOptions),
                "::",
                stringify!(properties)
            )
        );
    }
    test_field_properties();
    fn test_field_subscribeOptions() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_responseOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).subscribeOptions) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_responseOptions),
                "::",
                stringify!(subscribeOptions)
            )
        );
    }
    test_field_subscribeOptions();
    fn test_field_subscribeOptionsCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_responseOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).subscribeOptionsCount) as usize - ptr as usize
            },
            92usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_responseOptions),
                "::",
                stringify!(subscribeOptionsCount)
            )
        );
    }
    test_field_subscribeOptionsCount();
    fn test_field_subscribeOptionsList() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_responseOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).subscribeOptionsList) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_responseOptions),
                "::",
                stringify!(subscribeOptionsList)
            )
        );
    }
    test_field_subscribeOptionsList();
}
#[doc = " Structure to define call options.  For MQTT 5.0 there is input data as well as that"]
#[doc = " describing the response method.  So there is now also a synonym ::MQTTAsync_callOptions"]
#[doc = " to better reflect the use.  This responseOptions name is kept for backward"]
#[doc = " compatibility."]
pub type MQTTAsync_callOptions = MQTTAsync_responseOptions;
extern "C" {
    #[doc = " This function sets the global callback functions for a specific client."]
    #[doc = " If your client application doesn't use a particular callback, set the"]
    #[doc = " relevant parameter to NULL. Any necessary message acknowledgements and"]
    #[doc = " status communications are handled in the background without any intervention"]
    #[doc = " from the client application.  If you do not set a messageArrived callback"]
    #[doc = " function, you will not be notified of the receipt of any messages as a"]
    #[doc = " result of a subscription."]
    #[doc = ""]
    #[doc = " <b>Note:</b> The MQTT client must be disconnected when this function is"]
    #[doc = " called."]
    #[doc = " @param handle A valid client handle from a successful call to"]
    #[doc = " MQTTAsync_create()."]
    #[doc = " @param context A pointer to any application-specific context. The"]
    #[doc = " the <i>context</i> pointer is passed to each of the callback functions to"]
    #[doc = " provide access to the context information in the callback."]
    #[doc = " @param cl A pointer to an MQTTAsync_connectionLost() callback"]
    #[doc = " function. You can set this to NULL if your application doesn't handle"]
    #[doc = " disconnections."]
    #[doc = " @param ma A pointer to an MQTTAsync_messageArrived() callback"]
    #[doc = " function.  If this callback is not set, an error will be returned."]
    #[doc = " You must set this callback because otherwise there would be"]
    #[doc = " no way to deliver any incoming messages."]
    #[doc = " @param dc A pointer to an MQTTAsync_deliveryComplete() callback"]
    #[doc = " function. You can set this to NULL if you do not want to check"]
    #[doc = " for successful delivery."]
    #[doc = " @return ::MQTTASYNC_SUCCESS if the callbacks were correctly set,"]
    #[doc = " ::MQTTASYNC_FAILURE if an error occurred."]
    pub fn MQTTAsync_setCallbacks(
        handle: MQTTAsync,
        context: *mut ::std::os::raw::c_void,
        cl: MQTTAsync_connectionLost,
        ma: MQTTAsync_messageArrived,
        dc: MQTTAsync_deliveryComplete,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " This function sets the callback function for a connection lost event for"]
    #[doc = " a specific client. Any necessary message acknowledgements and status"]
    #[doc = " communications are handled in the background without any intervention"]
    #[doc = " from the client application."]
    #[doc = ""]
    #[doc = " <b>Note:</b> The MQTT client must be disconnected when this function is"]
    #[doc = " called."]
    #[doc = " @param handle A valid client handle from a successful call to"]
    #[doc = " MQTTAsync_create()."]
    #[doc = " @param context A pointer to any application-specific context. The"]
    #[doc = " the <i>context</i> pointer is passed the callback functions to provide"]
    #[doc = " access to the context information in the callback."]
    #[doc = " @param cl A pointer to an MQTTAsync_connectionLost() callback"]
    #[doc = " function. You can set this to NULL if your application doesn't handle"]
    #[doc = " disconnections."]
    #[doc = " @return ::MQTTASYNC_SUCCESS if the callbacks were correctly set,"]
    #[doc = " ::MQTTASYNC_FAILURE if an error occurred."]
    pub fn MQTTAsync_setConnectionLostCallback(
        handle: MQTTAsync,
        context: *mut ::std::os::raw::c_void,
        cl: MQTTAsync_connectionLost,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " This function sets the callback function for a message arrived event for"]
    #[doc = " a specific client. Any necessary message acknowledgements and status"]
    #[doc = " communications are handled in the background without any intervention"]
    #[doc = " from the client application.  If you do not set a messageArrived callback"]
    #[doc = " function, you will not be notified of the receipt of any messages as a"]
    #[doc = " result of a subscription."]
    #[doc = ""]
    #[doc = " <b>Note:</b> The MQTT client must be disconnected when this function is"]
    #[doc = " called."]
    #[doc = " @param handle A valid client handle from a successful call to"]
    #[doc = " MQTTAsync_create()."]
    #[doc = " @param context A pointer to any application-specific context. The"]
    #[doc = " the <i>context</i> pointer is passed to the callback functions to provide"]
    #[doc = " access to the context information in the callback."]
    #[doc = " @param ma A pointer to an MQTTAsync_messageArrived() callback"]
    #[doc = " function.  You can set this to NULL if your application doesn't handle"]
    #[doc = " receipt of messages."]
    #[doc = " @return ::MQTTASYNC_SUCCESS if the callbacks were correctly set,"]
    #[doc = " ::MQTTASYNC_FAILURE if an error occurred."]
    pub fn MQTTAsync_setMessageArrivedCallback(
        handle: MQTTAsync,
        context: *mut ::std::os::raw::c_void,
        ma: MQTTAsync_messageArrived,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " This function sets the callback function for a delivery complete event"]
    #[doc = " for a specific client. Any necessary message acknowledgements and status"]
    #[doc = " communications are handled in the background without any intervention"]
    #[doc = " from the client application."]
    #[doc = ""]
    #[doc = " <b>Note:</b> The MQTT client must be disconnected when this function is"]
    #[doc = " called."]
    #[doc = " @param handle A valid client handle from a successful call to"]
    #[doc = " MQTTAsync_create()."]
    #[doc = " @param context A pointer to any application-specific context. The"]
    #[doc = " the <i>context</i> pointer is passed to the callback functions to provide"]
    #[doc = " access to the context information in the callback."]
    #[doc = " @param dc A pointer to an MQTTAsync_deliveryComplete() callback"]
    #[doc = " function. You can set this to NULL if you do not want to check"]
    #[doc = " for successful delivery."]
    #[doc = " @return ::MQTTASYNC_SUCCESS if the callbacks were correctly set,"]
    #[doc = " ::MQTTASYNC_FAILURE if an error occurred."]
    pub fn MQTTAsync_setDeliveryCompleteCallback(
        handle: MQTTAsync,
        context: *mut ::std::os::raw::c_void,
        dc: MQTTAsync_deliveryComplete,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Sets the MQTTAsync_connected() callback function for a client."]
    #[doc = " @param handle A valid client handle from a successful call to"]
    #[doc = " MQTTAsync_create()."]
    #[doc = " @param context A pointer to any application-specific context. The"]
    #[doc = " the <i>context</i> pointer is passed to each of the callback functions to"]
    #[doc = " provide access to the context information in the callback."]
    #[doc = " @param co A pointer to an MQTTAsync_connected() callback"]
    #[doc = " function.  NULL removes the callback setting."]
    #[doc = " @return ::MQTTASYNC_SUCCESS if the callbacks were correctly set,"]
    #[doc = " ::MQTTASYNC_FAILURE if an error occurred."]
    pub fn MQTTAsync_setConnected(
        handle: MQTTAsync,
        context: *mut ::std::os::raw::c_void,
        co: MQTTAsync_connected,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Reconnects a client with the previously used connect options.  Connect"]
    #[doc = " must have previously been called for this to work."]
    #[doc = " @param handle A valid client handle from a successful call to"]
    #[doc = " MQTTAsync_create()."]
    #[doc = " @return ::MQTTASYNC_SUCCESS if the callbacks were correctly set,"]
    #[doc = " ::MQTTASYNC_FAILURE if an error occurred."]
    pub fn MQTTAsync_reconnect(handle: MQTTAsync) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " This function creates an MQTT client ready for connection to the"]
    #[doc = " specified server and using the specified persistent storage (see"]
    #[doc = " MQTTAsync_persistence). See also MQTTAsync_destroy()."]
    #[doc = " @param handle A pointer to an ::MQTTAsync handle. The handle is"]
    #[doc = " populated with a valid client reference following a successful return from"]
    #[doc = " this function."]
    #[doc = " @param serverURI A null-terminated string specifying the server to"]
    #[doc = " which the client will connect. It takes the form"]
    #[doc = " <i>protocol://host:port</i> where <i>protocol</i> must be:"]
    #[doc = " <br>"]
    #[doc = " @em tcp:// or @em mqtt:// - Insecure TCP"]
    #[doc = " <br>"]
    #[doc = " @em ssl:// or @em mqtts:// - Encrypted SSL/TLS"]
    #[doc = " <br>"]
    #[doc = " @em ws:// - Insecure websockets"]
    #[doc = " <br>"]
    #[doc = " @em wss:// - Secure web sockets"]
    #[doc = " <br>"]
    #[doc = " The TLS enabled prefixes (ssl, mqtts, wss) are only valid if a TLS"]
    #[doc = " version of the library is linked with."]
    #[doc = " For <i>host</i>, you can specify either an IP address or a host name. For"]
    #[doc = " instance, to connect to a server running on the local machines with the"]
    #[doc = " default MQTT port, specify <i>tcp://localhost:1883</i>."]
    #[doc = " @param clientId The client identifier passed to the server when the"]
    #[doc = " client connects to it. It is a null-terminated UTF-8 encoded string."]
    #[doc = " @param persistence_type The type of persistence to be used by the client:"]
    #[doc = " <br>"]
    #[doc = " ::MQTTCLIENT_PERSISTENCE_NONE: Use in-memory persistence. If the device or"]
    #[doc = " system on which the client is running fails or is switched off, the current"]
    #[doc = " state of any in-flight messages is lost and some messages may not be"]
    #[doc = " delivered even at QoS1 and QoS2."]
    #[doc = " <br>"]
    #[doc = " ::MQTTCLIENT_PERSISTENCE_DEFAULT: Use the default (file system-based)"]
    #[doc = " persistence mechanism. Status about in-flight messages is held in persistent"]
    #[doc = " storage and provides some protection against message loss in the case of"]
    #[doc = " unexpected failure."]
    #[doc = " <br>"]
    #[doc = " ::MQTTCLIENT_PERSISTENCE_USER: Use an application-specific persistence"]
    #[doc = " implementation. Using this type of persistence gives control of the"]
    #[doc = " persistence mechanism to the application. The application has to implement"]
    #[doc = " the MQTTClient_persistence interface."]
    #[doc = " @param persistence_context If the application uses"]
    #[doc = " ::MQTTCLIENT_PERSISTENCE_NONE persistence, this argument is unused and should"]
    #[doc = " be set to NULL. For ::MQTTCLIENT_PERSISTENCE_DEFAULT persistence, it"]
    #[doc = " should be set to the location of the persistence directory (if set"]
    #[doc = " to NULL, the persistence directory used is the working directory)."]
    #[doc = " Applications that use ::MQTTCLIENT_PERSISTENCE_USER persistence set this"]
    #[doc = " argument to point to a valid MQTTClient_persistence structure."]
    #[doc = " @return ::MQTTASYNC_SUCCESS if the client is successfully created, otherwise"]
    #[doc = " an error code is returned."]
    pub fn MQTTAsync_create(
        handle: *mut MQTTAsync,
        serverURI: *const ::std::os::raw::c_char,
        clientId: *const ::std::os::raw::c_char,
        persistence_type: ::std::os::raw::c_int,
        persistence_context: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
#[doc = " Options for the ::MQTTAsync_createWithOptions call"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MQTTAsync_createOptions {
    #[doc = " The eyecatcher for this structure.  must be MQCO."]
    pub struct_id: [::std::os::raw::c_char; 4usize],
    #[doc = " The version number of this structure.  Must be 0, 1, 2 or 3"]
    #[doc = " 0 means no MQTTVersion"]
    #[doc = " 1 means no allowDisconnectedSendAtAnyTime, deleteOldestMessages, restoreMessages"]
    #[doc = " 2 means no persistQoS0"]
    pub struct_version: ::std::os::raw::c_int,
    #[doc = " Whether to allow messages to be sent when the client library is not connected."]
    pub sendWhileDisconnected: ::std::os::raw::c_int,
    #[doc = " The maximum number of messages allowed to be buffered. This is intended to be used to"]
    #[doc = " limit the number of messages queued while the client is not connected. It also applies"]
    #[doc = " when the client is connected, however, so has to be greater than 0."]
    pub maxBufferedMessages: ::std::os::raw::c_int,
    #[doc = " Whether the MQTT version is 3.1, 3.1.1, or 5.  To use V5, this must be set."]
    #[doc = "  MQTT V5 has to be chosen here, because during the create call the message persistence"]
    #[doc = "  is initialized, and we want to know whether the format of any persisted messages"]
    #[doc = "  is appropriate for the MQTT version we are going to connect with.  Selecting 3.1 or"]
    #[doc = "  3.1.1 and attempting to read 5.0 persisted messages will result in an error on create."]
    pub MQTTVersion: ::std::os::raw::c_int,
    #[doc = " Allow sending of messages while disconnected before a first successful connect."]
    pub allowDisconnectedSendAtAnyTime: ::std::os::raw::c_int,
    pub deleteOldestMessages: ::std::os::raw::c_int,
    pub restoreMessages: ::std::os::raw::c_int,
    pub persistQoS0: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_MQTTAsync_createOptions() {
    assert_eq!(
        ::std::mem::size_of::<MQTTAsync_createOptions>(),
        36usize,
        concat!("Size of: ", stringify!(MQTTAsync_createOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTAsync_createOptions>(),
        4usize,
        concat!("Alignment of ", stringify!(MQTTAsync_createOptions))
    );
    fn test_field_struct_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_createOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).struct_id) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_createOptions),
                "::",
                stringify!(struct_id)
            )
        );
    }
    test_field_struct_id();
    fn test_field_struct_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_createOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).struct_version) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_createOptions),
                "::",
                stringify!(struct_version)
            )
        );
    }
    test_field_struct_version();
    fn test_field_sendWhileDisconnected() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_createOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sendWhileDisconnected) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_createOptions),
                "::",
                stringify!(sendWhileDisconnected)
            )
        );
    }
    test_field_sendWhileDisconnected();
    fn test_field_maxBufferedMessages() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_createOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxBufferedMessages) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_createOptions),
                "::",
                stringify!(maxBufferedMessages)
            )
        );
    }
    test_field_maxBufferedMessages();
    fn test_field_MQTTVersion() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_createOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MQTTVersion) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_createOptions),
                "::",
                stringify!(MQTTVersion)
            )
        );
    }
    test_field_MQTTVersion();
    fn test_field_allowDisconnectedSendAtAnyTime() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_createOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).allowDisconnectedSendAtAnyTime) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_createOptions),
                "::",
                stringify!(allowDisconnectedSendAtAnyTime)
            )
        );
    }
    test_field_allowDisconnectedSendAtAnyTime();
    fn test_field_deleteOldestMessages() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_createOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).deleteOldestMessages) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_createOptions),
                "::",
                stringify!(deleteOldestMessages)
            )
        );
    }
    test_field_deleteOldestMessages();
    fn test_field_restoreMessages() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_createOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).restoreMessages) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_createOptions),
                "::",
                stringify!(restoreMessages)
            )
        );
    }
    test_field_restoreMessages();
    fn test_field_persistQoS0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_createOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).persistQoS0) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_createOptions),
                "::",
                stringify!(persistQoS0)
            )
        );
    }
    test_field_persistQoS0();
}
extern "C" {
    pub fn MQTTAsync_createWithOptions(
        handle: *mut MQTTAsync,
        serverURI: *const ::std::os::raw::c_char,
        clientId: *const ::std::os::raw::c_char,
        persistence_type: ::std::os::raw::c_int,
        persistence_context: *mut ::std::os::raw::c_void,
        options: *mut MQTTAsync_createOptions,
    ) -> ::std::os::raw::c_int;
}
#[doc = " MQTTAsync_willOptions defines the MQTT \"Last Will and Testament\" (LWT) settings for"]
#[doc = " the client. In the event that a client unexpectedly loses its connection to"]
#[doc = " the server, the server publishes the LWT message to the LWT topic on"]
#[doc = " behalf of the client. This allows other clients (subscribed to the LWT topic)"]
#[doc = " to be made aware that the client has disconnected. To enable the LWT"]
#[doc = " function for a specific client, a valid pointer to an MQTTAsync_willOptions"]
#[doc = " structure is passed in the MQTTAsync_connectOptions structure used in the"]
#[doc = " MQTTAsync_connect() call that connects the client to the server. The pointer"]
#[doc = " to MQTTAsync_willOptions can be set to NULL if the LWT function is not"]
#[doc = " required."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MQTTAsync_willOptions {
    #[doc = " The eyecatcher for this structure.  must be MQTW."]
    pub struct_id: [::std::os::raw::c_char; 4usize],
    #[doc = " The version number of this structure.  Must be 0 or 1"]
    #[doc = "0 indicates no binary will message support"]
    pub struct_version: ::std::os::raw::c_int,
    #[doc = " The LWT topic to which the LWT message will be published."]
    pub topicName: *const ::std::os::raw::c_char,
    #[doc = " The LWT payload."]
    pub message: *const ::std::os::raw::c_char,
    #[doc = " The retained flag for the LWT message (see MQTTAsync_message.retained)."]
    pub retained: ::std::os::raw::c_int,
    #[doc = " The quality of service setting for the LWT message (see"]
    #[doc = " MQTTAsync_message.qos and @ref qos)."]
    pub qos: ::std::os::raw::c_int,
    pub payload: MQTTAsync_willOptions__bindgen_ty_1,
}
#[doc = " The LWT payload in binary form. This is only checked and used if the message option is NULL"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MQTTAsync_willOptions__bindgen_ty_1 {
    #[doc = "< binary payload length"]
    pub len: ::std::os::raw::c_int,
    #[doc = "< binary payload data"]
    pub data: *const ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_MQTTAsync_willOptions__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<MQTTAsync_willOptions__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(MQTTAsync_willOptions__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTAsync_willOptions__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(MQTTAsync_willOptions__bindgen_ty_1)
        )
    );
    fn test_field_len() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<MQTTAsync_willOptions__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_willOptions__bindgen_ty_1),
                "::",
                stringify!(len)
            )
        );
    }
    test_field_len();
    fn test_field_data() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<MQTTAsync_willOptions__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_willOptions__bindgen_ty_1),
                "::",
                stringify!(data)
            )
        );
    }
    test_field_data();
}
#[test]
fn bindgen_test_layout_MQTTAsync_willOptions() {
    assert_eq!(
        ::std::mem::size_of::<MQTTAsync_willOptions>(),
        48usize,
        concat!("Size of: ", stringify!(MQTTAsync_willOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTAsync_willOptions>(),
        8usize,
        concat!("Alignment of ", stringify!(MQTTAsync_willOptions))
    );
    fn test_field_struct_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_willOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).struct_id) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_willOptions),
                "::",
                stringify!(struct_id)
            )
        );
    }
    test_field_struct_id();
    fn test_field_struct_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_willOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).struct_version) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_willOptions),
                "::",
                stringify!(struct_version)
            )
        );
    }
    test_field_struct_version();
    fn test_field_topicName() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_willOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).topicName) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_willOptions),
                "::",
                stringify!(topicName)
            )
        );
    }
    test_field_topicName();
    fn test_field_message() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_willOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).message) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_willOptions),
                "::",
                stringify!(message)
            )
        );
    }
    test_field_message();
    fn test_field_retained() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_willOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).retained) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_willOptions),
                "::",
                stringify!(retained)
            )
        );
    }
    test_field_retained();
    fn test_field_qos() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_willOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).qos) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_willOptions),
                "::",
                stringify!(qos)
            )
        );
    }
    test_field_qos();
    fn test_field_payload() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_willOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).payload) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_willOptions),
                "::",
                stringify!(payload)
            )
        );
    }
    test_field_payload();
}
#[doc = " MQTTAsync_sslProperties defines the settings to establish an SSL/TLS connection using the"]
#[doc = " OpenSSL library. It covers the following scenarios:"]
#[doc = " - Server authentication: The client needs the digital certificate of the server. It is included"]
#[doc = "   in a store containting trusted material (also known as \"trust store\")."]
#[doc = " - Mutual authentication: Both client and server are authenticated during the SSL handshake. In"]
#[doc = "   addition to the digital certificate of the server in a trust store, the client will need its own"]
#[doc = "   digital certificate and the private key used to sign its digital certificate stored in a \"key store\"."]
#[doc = " - Anonymous connection: Both client and server do not get authenticated and no credentials are needed"]
#[doc = "   to establish an SSL connection. Note that this scenario is not fully secure since it is subject to"]
#[doc = "   man-in-the-middle attacks."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MQTTAsync_SSLOptions {
    #[doc = " The eyecatcher for this structure.  Must be MQTS"]
    pub struct_id: [::std::os::raw::c_char; 4usize],
    #[doc = " The version number of this structure. Must be 0, 1, 2, 3, 4 or 5."]
    #[doc = " 0 means no sslVersion"]
    #[doc = " 1 means no verify, CApath"]
    #[doc = " 2 means no ssl_error_context, ssl_error_cb"]
    #[doc = " 3 means no ssl_psk_cb, ssl_psk_context, disableDefaultTrustStore"]
    #[doc = " 4 means no protos, protos_len"]
    pub struct_version: ::std::os::raw::c_int,
    #[doc = " The file in PEM format containing the public digital certificates trusted by the client."]
    pub trustStore: *const ::std::os::raw::c_char,
    #[doc = " The file in PEM format containing the public certificate chain of the client. It may also include"]
    #[doc = " the client's private key."]
    pub keyStore: *const ::std::os::raw::c_char,
    #[doc = " If not included in the sslKeyStore, this setting points to the file in PEM format containing"]
    #[doc = " the client's private key."]
    pub privateKey: *const ::std::os::raw::c_char,
    #[doc = " The password to load the client's privateKey if encrypted."]
    pub privateKeyPassword: *const ::std::os::raw::c_char,
    #[doc = " The list of cipher suites that the client will present to the server during the SSL handshake. For a"]
    #[doc = " full explanation of the cipher list format, please see the OpenSSL on-line documentation:"]
    #[doc = " http://www.openssl.org/docs/apps/ciphers.html#CIPHER_LIST_FORMAT"]
    #[doc = " If this setting is ommitted, its default value will be \"ALL\", that is, all the cipher suites -excluding"]
    #[doc = " those offering no encryption- will be considered."]
    #[doc = " This setting can be used to set an SSL anonymous connection (\"aNULL\" string value, for instance)."]
    pub enabledCipherSuites: *const ::std::os::raw::c_char,
    #[doc = " True/False option to enable verification of the server certificate"]
    pub enableServerCertAuth: ::std::os::raw::c_int,
    #[doc = " The SSL/TLS version to use. Specify one of MQTT_SSL_VERSION_DEFAULT (0),"]
    #[doc = " MQTT_SSL_VERSION_TLS_1_0 (1), MQTT_SSL_VERSION_TLS_1_1 (2) or MQTT_SSL_VERSION_TLS_1_2 (3)."]
    #[doc = " Only used if struct_version is >= 1."]
    pub sslVersion: ::std::os::raw::c_int,
    #[doc = " Whether to carry out post-connect checks, including that a certificate"]
    #[doc = " matches the given host name."]
    #[doc = " Exists only if struct_version >= 2"]
    pub verify: ::std::os::raw::c_int,
    #[doc = " From the OpenSSL documentation:"]
    #[doc = " If CApath is not NULL, it points to a directory containing CA certificates in PEM format."]
    #[doc = " Exists only if struct_version >= 2"]
    pub CApath: *const ::std::os::raw::c_char,
    #[doc = " Callback function for OpenSSL error handler ERR_print_errors_cb"]
    #[doc = " Exists only if struct_version >= 3"]
    pub ssl_error_cb: ::std::option::Option<
        unsafe extern "C" fn(
            str_: *const ::std::os::raw::c_char,
            len: size_t,
            u: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Application-specific contex for OpenSSL error handler ERR_print_errors_cb"]
    #[doc = " Exists only if struct_version >= 3"]
    pub ssl_error_context: *mut ::std::os::raw::c_void,
    #[doc = " Callback function for setting TLS-PSK options. Parameters correspond to that of"]
    #[doc = " SSL_CTX_set_psk_client_callback, except for u which is the pointer ssl_psk_context."]
    #[doc = " Exists only if struct_version >= 4"]
    pub ssl_psk_cb: ::std::option::Option<
        unsafe extern "C" fn(
            hint: *const ::std::os::raw::c_char,
            identity: *mut ::std::os::raw::c_char,
            max_identity_len: ::std::os::raw::c_uint,
            psk: *mut ::std::os::raw::c_uchar,
            max_psk_len: ::std::os::raw::c_uint,
            u: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_uint,
    >,
    #[doc = " Application-specific contex for ssl_psk_cb"]
    #[doc = " Exists only if struct_version >= 4"]
    pub ssl_psk_context: *mut ::std::os::raw::c_void,
    #[doc = " Don't load default SSL CA. Should be used together with PSK to make sure"]
    #[doc = " regular servers with certificate in place is not accepted."]
    #[doc = " Exists only if struct_version >= 4"]
    pub disableDefaultTrustStore: ::std::os::raw::c_int,
    #[doc = " The protocol-lists must be in wire-format, which is defined as a vector of non-empty, 8-bit length-prefixed, byte strings."]
    #[doc = " The length-prefix byte is not included in the length. Each string is limited to 255 bytes. A byte-string length of 0 is invalid."]
    #[doc = " A truncated byte-string is invalid."]
    #[doc = " Check documentation for SSL_CTX_set_alpn_protos"]
    #[doc = " Exists only if struct_version >= 5"]
    pub protos: *const ::std::os::raw::c_uchar,
    #[doc = " The length of the vector protos vector"]
    #[doc = " Exists only if struct_version >= 5"]
    pub protos_len: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_MQTTAsync_SSLOptions() {
    assert_eq!(
        ::std::mem::size_of::<MQTTAsync_SSLOptions>(),
        128usize,
        concat!("Size of: ", stringify!(MQTTAsync_SSLOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTAsync_SSLOptions>(),
        8usize,
        concat!("Alignment of ", stringify!(MQTTAsync_SSLOptions))
    );
    fn test_field_struct_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_SSLOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).struct_id) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_SSLOptions),
                "::",
                stringify!(struct_id)
            )
        );
    }
    test_field_struct_id();
    fn test_field_struct_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_SSLOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).struct_version) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_SSLOptions),
                "::",
                stringify!(struct_version)
            )
        );
    }
    test_field_struct_version();
    fn test_field_trustStore() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_SSLOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).trustStore) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_SSLOptions),
                "::",
                stringify!(trustStore)
            )
        );
    }
    test_field_trustStore();
    fn test_field_keyStore() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_SSLOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).keyStore) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_SSLOptions),
                "::",
                stringify!(keyStore)
            )
        );
    }
    test_field_keyStore();
    fn test_field_privateKey() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_SSLOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).privateKey) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_SSLOptions),
                "::",
                stringify!(privateKey)
            )
        );
    }
    test_field_privateKey();
    fn test_field_privateKeyPassword() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_SSLOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).privateKeyPassword) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_SSLOptions),
                "::",
                stringify!(privateKeyPassword)
            )
        );
    }
    test_field_privateKeyPassword();
    fn test_field_enabledCipherSuites() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_SSLOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).enabledCipherSuites) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_SSLOptions),
                "::",
                stringify!(enabledCipherSuites)
            )
        );
    }
    test_field_enabledCipherSuites();
    fn test_field_enableServerCertAuth() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_SSLOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).enableServerCertAuth) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_SSLOptions),
                "::",
                stringify!(enableServerCertAuth)
            )
        );
    }
    test_field_enableServerCertAuth();
    fn test_field_sslVersion() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_SSLOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sslVersion) as usize - ptr as usize
            },
            52usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_SSLOptions),
                "::",
                stringify!(sslVersion)
            )
        );
    }
    test_field_sslVersion();
    fn test_field_verify() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_SSLOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).verify) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_SSLOptions),
                "::",
                stringify!(verify)
            )
        );
    }
    test_field_verify();
    fn test_field_CApath() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_SSLOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CApath) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_SSLOptions),
                "::",
                stringify!(CApath)
            )
        );
    }
    test_field_CApath();
    fn test_field_ssl_error_cb() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_SSLOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ssl_error_cb) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_SSLOptions),
                "::",
                stringify!(ssl_error_cb)
            )
        );
    }
    test_field_ssl_error_cb();
    fn test_field_ssl_error_context() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_SSLOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ssl_error_context) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_SSLOptions),
                "::",
                stringify!(ssl_error_context)
            )
        );
    }
    test_field_ssl_error_context();
    fn test_field_ssl_psk_cb() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_SSLOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ssl_psk_cb) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_SSLOptions),
                "::",
                stringify!(ssl_psk_cb)
            )
        );
    }
    test_field_ssl_psk_cb();
    fn test_field_ssl_psk_context() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_SSLOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ssl_psk_context) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_SSLOptions),
                "::",
                stringify!(ssl_psk_context)
            )
        );
    }
    test_field_ssl_psk_context();
    fn test_field_disableDefaultTrustStore() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_SSLOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).disableDefaultTrustStore) as usize - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_SSLOptions),
                "::",
                stringify!(disableDefaultTrustStore)
            )
        );
    }
    test_field_disableDefaultTrustStore();
    fn test_field_protos() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_SSLOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).protos) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_SSLOptions),
                "::",
                stringify!(protos)
            )
        );
    }
    test_field_protos();
    fn test_field_protos_len() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_SSLOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).protos_len) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_SSLOptions),
                "::",
                stringify!(protos_len)
            )
        );
    }
    test_field_protos_len();
}
#[doc = " Utility structure where name/value pairs are needed"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MQTTAsync_nameValue {
    #[doc = "< name string"]
    pub name: *const ::std::os::raw::c_char,
    #[doc = "< value string"]
    pub value: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_MQTTAsync_nameValue() {
    assert_eq!(
        ::std::mem::size_of::<MQTTAsync_nameValue>(),
        16usize,
        concat!("Size of: ", stringify!(MQTTAsync_nameValue))
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTAsync_nameValue>(),
        8usize,
        concat!("Alignment of ", stringify!(MQTTAsync_nameValue))
    );
    fn test_field_name() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_nameValue>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_nameValue),
                "::",
                stringify!(name)
            )
        );
    }
    test_field_name();
    fn test_field_value() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_nameValue>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_nameValue),
                "::",
                stringify!(value)
            )
        );
    }
    test_field_value();
}
#[doc = " MQTTAsync_connectOptions defines several settings that control the way the"]
#[doc = " client connects to an MQTT server."]
#[doc = ""]
#[doc = " Suitable default values are set in the following initializers:"]
#[doc = " - MQTTAsync_connectOptions_initializer: for MQTT 3.1.1 non-WebSockets"]
#[doc = " - MQTTAsync_connectOptions_initializer5: for MQTT 5.0 non-WebSockets"]
#[doc = " - MQTTAsync_connectOptions_initializer_ws: for MQTT 3.1.1 WebSockets"]
#[doc = " - MQTTAsync_connectOptions_initializer5_ws: for MQTT 5.0 WebSockets"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MQTTAsync_connectOptions {
    #[doc = " The eyecatcher for this structure.  must be MQTC."]
    pub struct_id: [::std::os::raw::c_char; 4usize],
    #[doc = " The version number of this structure.  Must be 0, 1, 2, 3 4 5 6, 7 or 8."]
    #[doc = " 0 signifies no SSL options and no serverURIs"]
    #[doc = " 1 signifies no serverURIs"]
    #[doc = " 2 signifies no MQTTVersion"]
    #[doc = " 3 signifies no automatic reconnect options"]
    #[doc = " 4 signifies no binary password option (just string)"]
    #[doc = " 5 signifies no MQTTV5 properties"]
    #[doc = " 6 signifies no HTTP headers option"]
    #[doc = " 7 signifies no HTTP proxy and HTTPS proxy options"]
    pub struct_version: ::std::os::raw::c_int,
    #[doc = " The \"keep alive\" interval, measured in seconds, defines the maximum time"]
    #[doc = " that should pass without communication between the client and the server"]
    #[doc = " The client will ensure that at least one message travels across the"]
    #[doc = " network within each keep alive period.  In the absence of a data-related"]
    #[doc = " message during the time period, the client sends a very small MQTT"]
    #[doc = " \"ping\" message, which the server will acknowledge. The keep alive"]
    #[doc = " interval enables the client to detect when the server is no longer"]
    #[doc = " available without having to wait for the long TCP/IP timeout."]
    #[doc = " Set to 0 if you do not want any keep alive processing."]
    pub keepAliveInterval: ::std::os::raw::c_int,
    #[doc = " This is a boolean value. The cleansession setting controls the behaviour"]
    #[doc = " of both the client and the server at connection and disconnection time."]
    #[doc = " The client and server both maintain session state information. This"]
    #[doc = " information is used to ensure \"at least once\" and \"exactly once\""]
    #[doc = " delivery, and \"exactly once\" receipt of messages. Session state also"]
    #[doc = " includes subscriptions created by an MQTT client. You can choose to"]
    #[doc = " maintain or discard state information between sessions."]
    #[doc = ""]
    #[doc = " When cleansession is true, the state information is discarded at"]
    #[doc = " connect and disconnect. Setting cleansession to false keeps the state"]
    #[doc = " information. When you connect an MQTT client application with"]
    #[doc = " MQTTAsync_connect(), the client identifies the connection using the"]
    #[doc = " client identifier and the address of the server. The server checks"]
    #[doc = " whether session information for this client"]
    #[doc = " has been saved from a previous connection to the server. If a previous"]
    #[doc = " session still exists, and cleansession=true, then the previous session"]
    #[doc = " information at the client and server is cleared. If cleansession=false,"]
    #[doc = " the previous session is resumed. If no previous session exists, a new"]
    #[doc = " session is started."]
    pub cleansession: ::std::os::raw::c_int,
    #[doc = " This controls how many messages can be in-flight simultaneously."]
    pub maxInflight: ::std::os::raw::c_int,
    #[doc = " This is a pointer to an MQTTAsync_willOptions structure. If your"]
    #[doc = " application does not make use of the Last Will and Testament feature,"]
    #[doc = " set this pointer to NULL."]
    pub will: *mut MQTTAsync_willOptions,
    #[doc = " MQTT servers that support the MQTT v3.1 protocol provide authentication"]
    #[doc = " and authorisation by user name and password. This is the user name"]
    #[doc = " parameter."]
    pub username: *const ::std::os::raw::c_char,
    #[doc = " MQTT servers that support the MQTT v3.1 protocol provide authentication"]
    #[doc = " and authorisation by user name and password. This is the password"]
    #[doc = " parameter."]
    pub password: *const ::std::os::raw::c_char,
    #[doc = " The time interval in seconds to allow a connect to complete."]
    pub connectTimeout: ::std::os::raw::c_int,
    #[doc = " The time interval in seconds after which unacknowledged publish requests are"]
    #[doc = " retried during a TCP session.  With MQTT 3.1.1 and later, retries are"]
    #[doc = " not required except on reconnect.  0 turns off in-session retries, and is the"]
    #[doc = " recommended setting.  Adding retries to an already overloaded network only"]
    #[doc = " exacerbates the problem."]
    pub retryInterval: ::std::os::raw::c_int,
    #[doc = " This is a pointer to an MQTTAsync_SSLOptions structure. If your"]
    #[doc = " application does not make use of SSL, set this pointer to NULL."]
    pub ssl: *mut MQTTAsync_SSLOptions,
    #[doc = " A pointer to a callback function to be called if the connect successfully"]
    #[doc = " completes.  Can be set to NULL, in which case no indication of successful"]
    #[doc = " completion will be received."]
    pub onSuccess: MQTTAsync_onSuccess,
    #[doc = " A pointer to a callback function to be called if the connect fails."]
    #[doc = " Can be set to NULL, in which case no indication of unsuccessful"]
    #[doc = " completion will be received."]
    pub onFailure: MQTTAsync_onFailure,
    #[doc = " A pointer to any application-specific context. The"]
    #[doc = " the <i>context</i> pointer is passed to success or failure callback functions to"]
    #[doc = " provide access to the context information in the callback."]
    pub context: *mut ::std::os::raw::c_void,
    #[doc = " The number of entries in the serverURIs array."]
    pub serverURIcount: ::std::os::raw::c_int,
    #[doc = " An array of null-terminated strings specifying the servers to"]
    #[doc = " which the client will connect. Each string takes the form <i>protocol://host:port</i>."]
    #[doc = " <i>protocol</i> must be <i>tcp</i>, <i>ssl</i>, <i>ws</i> or <i>wss</i>."]
    #[doc = " The TLS enabled prefixes (ssl, wss) are only valid if a TLS version of the library"]
    #[doc = " is linked with."]
    #[doc = " For <i>host</i>, you can"]
    #[doc = " specify either an IP address or a domain name. For instance, to connect to"]
    #[doc = " a server running on the local machines with the default MQTT port, specify"]
    #[doc = " <i>tcp://localhost:1883</i>."]
    pub serverURIs: *const *mut ::std::os::raw::c_char,
    #[doc = " Sets the version of MQTT to be used on the connect."]
    #[doc = " MQTTVERSION_DEFAULT (0) = default: start with 3.1.1, and if that fails, fall back to 3.1"]
    #[doc = " MQTTVERSION_3_1 (3) = only try version 3.1"]
    #[doc = " MQTTVERSION_3_1_1 (4) = only try version 3.1.1"]
    pub MQTTVersion: ::std::os::raw::c_int,
    #[doc = " Reconnect automatically in the case of a connection being lost. 0=false, 1=true"]
    pub automaticReconnect: ::std::os::raw::c_int,
    #[doc = " The minimum automatic reconnect retry interval in seconds. Doubled on each failed retry."]
    pub minRetryInterval: ::std::os::raw::c_int,
    #[doc = " The maximum automatic reconnect retry interval in seconds. The doubling stops here on failed retries."]
    pub maxRetryInterval: ::std::os::raw::c_int,
    pub binarypwd: MQTTAsync_connectOptions__bindgen_ty_1,
    pub cleanstart: ::std::os::raw::c_int,
    #[doc = " MQTT V5 properties for connect"]
    pub connectProperties: *mut MQTTProperties,
    #[doc = " MQTT V5 properties for the will message in the connect"]
    pub willProperties: *mut MQTTProperties,
    #[doc = " A pointer to a callback function to be called if the connect successfully"]
    #[doc = " completes.  Can be set to NULL, in which case no indication of successful"]
    #[doc = " completion will be received."]
    pub onSuccess5: MQTTAsync_onSuccess5,
    #[doc = " A pointer to a callback function to be called if the connect fails."]
    #[doc = " Can be set to NULL, in which case no indication of unsuccessful"]
    #[doc = " completion will be received."]
    pub onFailure5: MQTTAsync_onFailure5,
    #[doc = " HTTP headers for websockets"]
    pub httpHeaders: *const MQTTAsync_nameValue,
    #[doc = " HTTP proxy"]
    pub httpProxy: *const ::std::os::raw::c_char,
    #[doc = " HTTPS proxy"]
    pub httpsProxy: *const ::std::os::raw::c_char,
}
#[doc = " Optional binary password.  Only checked and used if the password option is NULL"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MQTTAsync_connectOptions__bindgen_ty_1 {
    #[doc = "< binary password length"]
    pub len: ::std::os::raw::c_int,
    #[doc = "< binary password data"]
    pub data: *const ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_MQTTAsync_connectOptions__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<MQTTAsync_connectOptions__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(MQTTAsync_connectOptions__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTAsync_connectOptions__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(MQTTAsync_connectOptions__bindgen_ty_1)
        )
    );
    fn test_field_len() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<MQTTAsync_connectOptions__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions__bindgen_ty_1),
                "::",
                stringify!(len)
            )
        );
    }
    test_field_len();
    fn test_field_data() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<MQTTAsync_connectOptions__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions__bindgen_ty_1),
                "::",
                stringify!(data)
            )
        );
    }
    test_field_data();
}
#[test]
fn bindgen_test_layout_MQTTAsync_connectOptions() {
    assert_eq!(
        ::std::mem::size_of::<MQTTAsync_connectOptions>(),
        200usize,
        concat!("Size of: ", stringify!(MQTTAsync_connectOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTAsync_connectOptions>(),
        8usize,
        concat!("Alignment of ", stringify!(MQTTAsync_connectOptions))
    );
    fn test_field_struct_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).struct_id) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(struct_id)
            )
        );
    }
    test_field_struct_id();
    fn test_field_struct_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).struct_version) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(struct_version)
            )
        );
    }
    test_field_struct_version();
    fn test_field_keepAliveInterval() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).keepAliveInterval) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(keepAliveInterval)
            )
        );
    }
    test_field_keepAliveInterval();
    fn test_field_cleansession() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cleansession) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(cleansession)
            )
        );
    }
    test_field_cleansession();
    fn test_field_maxInflight() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxInflight) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(maxInflight)
            )
        );
    }
    test_field_maxInflight();
    fn test_field_will() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).will) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(will)
            )
        );
    }
    test_field_will();
    fn test_field_username() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).username) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(username)
            )
        );
    }
    test_field_username();
    fn test_field_password() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).password) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(password)
            )
        );
    }
    test_field_password();
    fn test_field_connectTimeout() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).connectTimeout) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(connectTimeout)
            )
        );
    }
    test_field_connectTimeout();
    fn test_field_retryInterval() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).retryInterval) as usize - ptr as usize
            },
            52usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(retryInterval)
            )
        );
    }
    test_field_retryInterval();
    fn test_field_ssl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ssl) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(ssl)
            )
        );
    }
    test_field_ssl();
    fn test_field_onSuccess() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).onSuccess) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(onSuccess)
            )
        );
    }
    test_field_onSuccess();
    fn test_field_onFailure() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).onFailure) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(onFailure)
            )
        );
    }
    test_field_onFailure();
    fn test_field_context() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).context) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(context)
            )
        );
    }
    test_field_context();
    fn test_field_serverURIcount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).serverURIcount) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(serverURIcount)
            )
        );
    }
    test_field_serverURIcount();
    fn test_field_serverURIs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).serverURIs) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(serverURIs)
            )
        );
    }
    test_field_serverURIs();
    fn test_field_MQTTVersion() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MQTTVersion) as usize - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(MQTTVersion)
            )
        );
    }
    test_field_MQTTVersion();
    fn test_field_automaticReconnect() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).automaticReconnect) as usize - ptr as usize
            },
            108usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(automaticReconnect)
            )
        );
    }
    test_field_automaticReconnect();
    fn test_field_minRetryInterval() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).minRetryInterval) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(minRetryInterval)
            )
        );
    }
    test_field_minRetryInterval();
    fn test_field_maxRetryInterval() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxRetryInterval) as usize - ptr as usize
            },
            116usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(maxRetryInterval)
            )
        );
    }
    test_field_maxRetryInterval();
    fn test_field_binarypwd() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).binarypwd) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(binarypwd)
            )
        );
    }
    test_field_binarypwd();
    fn test_field_cleanstart() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cleanstart) as usize - ptr as usize
            },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(cleanstart)
            )
        );
    }
    test_field_cleanstart();
    fn test_field_connectProperties() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).connectProperties) as usize - ptr as usize
            },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(connectProperties)
            )
        );
    }
    test_field_connectProperties();
    fn test_field_willProperties() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).willProperties) as usize - ptr as usize
            },
            152usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(willProperties)
            )
        );
    }
    test_field_willProperties();
    fn test_field_onSuccess5() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).onSuccess5) as usize - ptr as usize
            },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(onSuccess5)
            )
        );
    }
    test_field_onSuccess5();
    fn test_field_onFailure5() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).onFailure5) as usize - ptr as usize
            },
            168usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(onFailure5)
            )
        );
    }
    test_field_onFailure5();
    fn test_field_httpHeaders() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).httpHeaders) as usize - ptr as usize
            },
            176usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(httpHeaders)
            )
        );
    }
    test_field_httpHeaders();
    fn test_field_httpProxy() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).httpProxy) as usize - ptr as usize
            },
            184usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(httpProxy)
            )
        );
    }
    test_field_httpProxy();
    fn test_field_httpsProxy() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_connectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).httpsProxy) as usize - ptr as usize
            },
            192usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_connectOptions),
                "::",
                stringify!(httpsProxy)
            )
        );
    }
    test_field_httpsProxy();
}
extern "C" {
    #[doc = " This function attempts to connect a previously-created client (see"]
    #[doc = " MQTTAsync_create()) to an MQTT server using the specified options. If you"]
    #[doc = " want to enable asynchronous message and status notifications, you must call"]
    #[doc = " MQTTAsync_setCallbacks() prior to MQTTAsync_connect()."]
    #[doc = " @param handle A valid client handle from a successful call to"]
    #[doc = " MQTTAsync_create()."]
    #[doc = " @param options A pointer to a valid MQTTAsync_connectOptions"]
    #[doc = " structure."]
    #[doc = " @return ::MQTTASYNC_SUCCESS if the client connect request was accepted."]
    #[doc = " If the client was unable to connect to the server, an error code is"]
    #[doc = " returned via the onFailure callback, if set."]
    #[doc = " Error codes greater than 0 are returned by the MQTT protocol:<br><br>"]
    #[doc = " <b>1</b>: Connection refused: Unacceptable protocol version<br>"]
    #[doc = " <b>2</b>: Connection refused: Identifier rejected<br>"]
    #[doc = " <b>3</b>: Connection refused: Server unavailable<br>"]
    #[doc = " <b>4</b>: Connection refused: Bad user name or password<br>"]
    #[doc = " <b>5</b>: Connection refused: Not authorized<br>"]
    #[doc = " <b>6-255</b>: Reserved for future use<br>"]
    pub fn MQTTAsync_connect(
        handle: MQTTAsync,
        options: *const MQTTAsync_connectOptions,
    ) -> ::std::os::raw::c_int;
}
#[doc = " Options for the ::MQTTAsync_disconnect call"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MQTTAsync_disconnectOptions {
    #[doc = " The eyecatcher for this structure. Must be MQTD."]
    pub struct_id: [::std::os::raw::c_char; 4usize],
    #[doc = " The version number of this structure.  Must be 0 or 1.  0 signifies no V5 properties"]
    pub struct_version: ::std::os::raw::c_int,
    #[doc = " The client delays disconnection for up to this time (in"]
    #[doc = " milliseconds) in order to allow in-flight message transfers to complete."]
    pub timeout: ::std::os::raw::c_int,
    #[doc = " A pointer to a callback function to be called if the disconnect successfully"]
    #[doc = " completes.  Can be set to NULL, in which case no indication of successful"]
    #[doc = " completion will be received."]
    pub onSuccess: MQTTAsync_onSuccess,
    #[doc = " A pointer to a callback function to be called if the disconnect fails."]
    #[doc = " Can be set to NULL, in which case no indication of unsuccessful"]
    #[doc = " completion will be received."]
    pub onFailure: MQTTAsync_onFailure,
    #[doc = " A pointer to any application-specific context. The"]
    #[doc = " the <i>context</i> pointer is passed to success or failure callback functions to"]
    #[doc = " provide access to the context information in the callback."]
    pub context: *mut ::std::os::raw::c_void,
    #[doc = " MQTT V5 input properties"]
    pub properties: MQTTProperties,
    #[doc = " Reason code for MQTTV5 disconnect"]
    pub reasonCode: MQTTReasonCodes,
    #[doc = " A pointer to a callback function to be called if the disconnect successfully"]
    #[doc = " completes.  Can be set to NULL, in which case no indication of successful"]
    #[doc = " completion will be received."]
    pub onSuccess5: MQTTAsync_onSuccess5,
    #[doc = " A pointer to a callback function to be called if the disconnect fails."]
    #[doc = " Can be set to NULL, in which case no indication of unsuccessful"]
    #[doc = " completion will be received."]
    pub onFailure5: MQTTAsync_onFailure5,
}
#[test]
fn bindgen_test_layout_MQTTAsync_disconnectOptions() {
    assert_eq!(
        ::std::mem::size_of::<MQTTAsync_disconnectOptions>(),
        88usize,
        concat!("Size of: ", stringify!(MQTTAsync_disconnectOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<MQTTAsync_disconnectOptions>(),
        8usize,
        concat!("Alignment of ", stringify!(MQTTAsync_disconnectOptions))
    );
    fn test_field_struct_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_disconnectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).struct_id) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_disconnectOptions),
                "::",
                stringify!(struct_id)
            )
        );
    }
    test_field_struct_id();
    fn test_field_struct_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_disconnectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).struct_version) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_disconnectOptions),
                "::",
                stringify!(struct_version)
            )
        );
    }
    test_field_struct_version();
    fn test_field_timeout() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_disconnectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).timeout) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_disconnectOptions),
                "::",
                stringify!(timeout)
            )
        );
    }
    test_field_timeout();
    fn test_field_onSuccess() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_disconnectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).onSuccess) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_disconnectOptions),
                "::",
                stringify!(onSuccess)
            )
        );
    }
    test_field_onSuccess();
    fn test_field_onFailure() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_disconnectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).onFailure) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_disconnectOptions),
                "::",
                stringify!(onFailure)
            )
        );
    }
    test_field_onFailure();
    fn test_field_context() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_disconnectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).context) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_disconnectOptions),
                "::",
                stringify!(context)
            )
        );
    }
    test_field_context();
    fn test_field_properties() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_disconnectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).properties) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_disconnectOptions),
                "::",
                stringify!(properties)
            )
        );
    }
    test_field_properties();
    fn test_field_reasonCode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_disconnectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).reasonCode) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_disconnectOptions),
                "::",
                stringify!(reasonCode)
            )
        );
    }
    test_field_reasonCode();
    fn test_field_onSuccess5() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_disconnectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).onSuccess5) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_disconnectOptions),
                "::",
                stringify!(onSuccess5)
            )
        );
    }
    test_field_onSuccess5();
    fn test_field_onFailure5() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MQTTAsync_disconnectOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).onFailure5) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(MQTTAsync_disconnectOptions),
                "::",
                stringify!(onFailure5)
            )
        );
    }
    test_field_onFailure5();
}
extern "C" {
    #[doc = " This function attempts to disconnect the client from the MQTT"]
    #[doc = " server. In order to allow the client time to complete handling of messages"]
    #[doc = " that are in-flight when this function is called, a timeout period is"]
    #[doc = " specified. When the timeout period has expired, the client disconnects even"]
    #[doc = " if there are still outstanding message acknowledgements."]
    #[doc = " The next time the client connects to the same server, any QoS 1 or 2"]
    #[doc = " messages which have not completed will be retried depending on the"]
    #[doc = " cleansession settings for both the previous and the new connection (see"]
    #[doc = " MQTTAsync_connectOptions.cleansession and MQTTAsync_connect())."]
    #[doc = " @param handle A valid client handle from a successful call to"]
    #[doc = " MQTTAsync_create()."]
    #[doc = " @param options The client delays disconnection for up to this time (in"]
    #[doc = " milliseconds) in order to allow in-flight message transfers to complete."]
    #[doc = " @return ::MQTTASYNC_SUCCESS if the client successfully disconnects from"]
    #[doc = " the server. An error code is returned if the client was unable to disconnect"]
    #[doc = " from the server"]
    pub fn MQTTAsync_disconnect(
        handle: MQTTAsync,
        options: *const MQTTAsync_disconnectOptions,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " This function allows the client application to test whether or not a"]
    #[doc = " client is currently connected to the MQTT server."]
    #[doc = " @param handle A valid client handle from a successful call to"]
    #[doc = " MQTTAsync_create()."]
    #[doc = " @return Boolean true if the client is connected, otherwise false."]
    pub fn MQTTAsync_isConnected(handle: MQTTAsync) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " This function attempts to subscribe a client to a single topic, which may"]
    #[doc = " contain wildcards (see @ref wildcard). This call also specifies the"]
    #[doc = " @ref qos requested for the subscription"]
    #[doc = " (see also MQTTAsync_subscribeMany())."]
    #[doc = " @param handle A valid client handle from a successful call to"]
    #[doc = " MQTTAsync_create()."]
    #[doc = " @param topic The subscription topic, which may include wildcards."]
    #[doc = " @param qos The requested quality of service for the subscription."]
    #[doc = " @param response A pointer to a response options structure. Used to set callback functions."]
    #[doc = " @return ::MQTTASYNC_SUCCESS if the subscription request is successful."]
    #[doc = " An error code is returned if there was a problem registering the"]
    #[doc = " subscription."]
    pub fn MQTTAsync_subscribe(
        handle: MQTTAsync,
        topic: *const ::std::os::raw::c_char,
        qos: ::std::os::raw::c_int,
        response: *mut MQTTAsync_responseOptions,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " This function attempts to subscribe a client to a list of topics, which may"]
    #[doc = " contain wildcards (see @ref wildcard). This call also specifies the"]
    #[doc = " @ref qos requested for each topic (see also MQTTAsync_subscribe())."]
    #[doc = " @param handle A valid client handle from a successful call to"]
    #[doc = " MQTTAsync_create()."]
    #[doc = " @param count The number of topics for which the client is requesting"]
    #[doc = " subscriptions."]
    #[doc = " @param topic An array (of length <i>count</i>) of pointers to"]
    #[doc = " topics, each of which may include wildcards."]
    #[doc = " @param qos An array (of length <i>count</i>) of @ref qos"]
    #[doc = " values. qos[n] is the requested QoS for topic[n]."]
    #[doc = " @param response A pointer to a response options structure. Used to set callback functions."]
    #[doc = " @return ::MQTTASYNC_SUCCESS if the subscription request is successful."]
    #[doc = " An error code is returned if there was a problem registering the"]
    #[doc = " subscriptions."]
    pub fn MQTTAsync_subscribeMany(
        handle: MQTTAsync,
        count: ::std::os::raw::c_int,
        topic: *const *mut ::std::os::raw::c_char,
        qos: *const ::std::os::raw::c_int,
        response: *mut MQTTAsync_responseOptions,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " This function attempts to remove an existing subscription made by the"]
    #[doc = " specified client."]
    #[doc = " @param handle A valid client handle from a successful call to"]
    #[doc = " MQTTAsync_create()."]
    #[doc = " @param topic The topic for the subscription to be removed, which may"]
    #[doc = " include wildcards (see @ref wildcard)."]
    #[doc = " @param response A pointer to a response options structure. Used to set callback functions."]
    #[doc = " @return ::MQTTASYNC_SUCCESS if the subscription is removed."]
    #[doc = " An error code is returned if there was a problem removing the"]
    #[doc = " subscription."]
    pub fn MQTTAsync_unsubscribe(
        handle: MQTTAsync,
        topic: *const ::std::os::raw::c_char,
        response: *mut MQTTAsync_responseOptions,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " This function attempts to remove existing subscriptions to a list of topics"]
    #[doc = " made by the specified client."]
    #[doc = " @param handle A valid client handle from a successful call to"]
    #[doc = " MQTTAsync_create()."]
    #[doc = " @param count The number subscriptions to be removed."]
    #[doc = " @param topic An array (of length <i>count</i>) of pointers to the topics of"]
    #[doc = " the subscriptions to be removed, each of which may include wildcards."]
    #[doc = " @param response A pointer to a response options structure. Used to set callback functions."]
    #[doc = " @return ::MQTTASYNC_SUCCESS if the subscriptions are removed."]
    #[doc = " An error code is returned if there was a problem removing the subscriptions."]
    pub fn MQTTAsync_unsubscribeMany(
        handle: MQTTAsync,
        count: ::std::os::raw::c_int,
        topic: *const *mut ::std::os::raw::c_char,
        response: *mut MQTTAsync_responseOptions,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " This function attempts to publish a message to a given topic (see also"]
    #[doc = " ::MQTTAsync_sendMessage()). An ::MQTTAsync_token is issued when"]
    #[doc = " this function returns successfully if the QoS is greater than 0."]
    #[doc = " If the client application needs to"]
    #[doc = " test for successful delivery of messages, a callback should be set"]
    #[doc = " (see ::MQTTAsync_onSuccess() and ::MQTTAsync_deliveryComplete())."]
    #[doc = " @param handle A valid client handle from a successful call to"]
    #[doc = " MQTTAsync_create()."]
    #[doc = " @param destinationName The topic associated with this message."]
    #[doc = " @param payloadlen The length of the payload in bytes."]
    #[doc = " @param payload A pointer to the byte array payload of the message."]
    #[doc = " @param qos The @ref qos of the message."]
    #[doc = " @param retained The retained flag for the message."]
    #[doc = " @param response A pointer to an ::MQTTAsync_responseOptions structure. Used to set callback functions."]
    #[doc = " This is optional and can be set to NULL."]
    #[doc = " @return ::MQTTASYNC_SUCCESS if the message is accepted for publication."]
    #[doc = " An error code is returned if there was a problem accepting the message."]
    pub fn MQTTAsync_send(
        handle: MQTTAsync,
        destinationName: *const ::std::os::raw::c_char,
        payloadlen: ::std::os::raw::c_int,
        payload: *const ::std::os::raw::c_void,
        qos: ::std::os::raw::c_int,
        retained: ::std::os::raw::c_int,
        response: *mut MQTTAsync_responseOptions,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " This function attempts to publish a message to a given topic (see also"]
    #[doc = " MQTTAsync_publish()). An ::MQTTAsync_token is issued when"]
    #[doc = " this function returns successfully if the QoS is greater than 0."]
    #[doc = " If the client application needs to"]
    #[doc = " test for successful delivery of messages, a callback should be set"]
    #[doc = " (see ::MQTTAsync_onSuccess() and ::MQTTAsync_deliveryComplete())."]
    #[doc = " @param handle A valid client handle from a successful call to"]
    #[doc = " MQTTAsync_create()."]
    #[doc = " @param destinationName The topic associated with this message."]
    #[doc = " @param msg A pointer to a valid MQTTAsync_message structure containing"]
    #[doc = " the payload and attributes of the message to be published."]
    #[doc = " @param response A pointer to an ::MQTTAsync_responseOptions structure. Used to set callback functions."]
    #[doc = " @return ::MQTTASYNC_SUCCESS if the message is accepted for publication."]
    #[doc = " An error code is returned if there was a problem accepting the message."]
    pub fn MQTTAsync_sendMessage(
        handle: MQTTAsync,
        destinationName: *const ::std::os::raw::c_char,
        msg: *const MQTTAsync_message,
        response: *mut MQTTAsync_responseOptions,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " This function sets a pointer to an array of tokens for"]
    #[doc = " messages that are currently in-flight (pending completion)."]
    #[doc = ""]
    #[doc = " <b>Important note:</b> The memory used to hold the array of tokens is"]
    #[doc = " malloc()'d in this function. The client application is responsible for"]
    #[doc = " freeing this memory when it is no longer required."]
    #[doc = " @param handle A valid client handle from a successful call to"]
    #[doc = " MQTTAsync_create()."]
    #[doc = " @param tokens The address of a pointer to an ::MQTTAsync_token."]
    #[doc = " When the function returns successfully, the pointer is set to point to an"]
    #[doc = " array of tokens representing messages pending completion. The last member of"]
    #[doc = " the array is set to -1 to indicate there are no more tokens. If no tokens"]
    #[doc = " are pending, the pointer is set to NULL."]
    #[doc = " @return ::MQTTASYNC_SUCCESS if the function returns successfully."]
    #[doc = " An error code is returned if there was a problem obtaining the list of"]
    #[doc = " pending tokens."]
    pub fn MQTTAsync_getPendingTokens(
        handle: MQTTAsync,
        tokens: *mut *mut MQTTAsync_token,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn MQTTAsync_isComplete(handle: MQTTAsync, token: MQTTAsync_token)
        -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Waits for a request corresponding to a token to complete.  This only works for"]
    #[doc = " messages with QoS greater than 0.  A QoS 0 message has no MQTT token."]
    #[doc = " This function will always return ::MQTTASYNC_SUCCESS for a QoS 0 message."]
    #[doc = ""]
    #[doc = " @param handle A valid client handle from a successful call to"]
    #[doc = " MQTTAsync_create()."]
    #[doc = " @param token An ::MQTTAsync_token associated with a request."]
    #[doc = " @param timeout the maximum time to wait for completion, in milliseconds"]
    #[doc = " @return ::MQTTASYNC_SUCCESS if the request has been completed in the time allocated,"]
    #[doc = "  ::MQTTASYNC_FAILURE or ::MQTTASYNC_DISCONNECTED if not."]
    pub fn MQTTAsync_waitForCompletion(
        handle: MQTTAsync,
        token: MQTTAsync_token,
        timeout: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " This function frees memory allocated to an MQTT message, including the"]
    #[doc = " additional memory allocated to the message payload. The client application"]
    #[doc = " calls this function when the message has been fully processed. <b>Important"]
    #[doc = " note:</b> This function does not free the memory allocated to a message"]
    #[doc = " topic string. It is the responsibility of the client application to free"]
    #[doc = " this memory using the MQTTAsync_free() library function."]
    #[doc = " @param msg The address of a pointer to the ::MQTTAsync_message structure"]
    #[doc = " to be freed."]
    pub fn MQTTAsync_freeMessage(msg: *mut *mut MQTTAsync_message);
}
extern "C" {
    #[doc = " This function frees memory allocated by the MQTT C client library, especially the"]
    #[doc = " topic name. This is needed on Windows when the client library and application"]
    #[doc = " program have been compiled with different versions of the C compiler.  It is"]
    #[doc = " thus good policy to always use this function when freeing any MQTT C client-"]
    #[doc = " allocated memory."]
    #[doc = " @param ptr The pointer to the client library storage to be freed."]
    pub fn MQTTAsync_free(ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    #[doc = " This function is used to allocate memory to be used or freed by the MQTT C client library,"]
    #[doc = " especially the data in the ::MQTTPersistence_afterRead and ::MQTTPersistence_beforeWrite"]
    #[doc = " callbacks. This is needed on Windows when the client library and application"]
    #[doc = " program have been compiled with different versions of the C compiler."]
    #[doc = " @param size The size of the memory to be allocated."]
    pub fn MQTTAsync_malloc(size: size_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " This function frees the memory allocated to an MQTT client (see"]
    #[doc = " MQTTAsync_create()). It should be called when the client is no longer"]
    #[doc = " required."]
    #[doc = " @param handle A pointer to the handle referring to the ::MQTTAsync"]
    #[doc = " structure to be freed."]
    pub fn MQTTAsync_destroy(handle: *mut MQTTAsync);
}
pub const MQTTASYNC_TRACE_LEVELS_MQTTASYNC_TRACE_MAXIMUM: MQTTASYNC_TRACE_LEVELS = 1;
pub const MQTTASYNC_TRACE_LEVELS_MQTTASYNC_TRACE_MEDIUM: MQTTASYNC_TRACE_LEVELS = 2;
pub const MQTTASYNC_TRACE_LEVELS_MQTTASYNC_TRACE_MINIMUM: MQTTASYNC_TRACE_LEVELS = 3;
pub const MQTTASYNC_TRACE_LEVELS_MQTTASYNC_TRACE_PROTOCOL: MQTTASYNC_TRACE_LEVELS = 4;
pub const MQTTASYNC_TRACE_LEVELS_MQTTASYNC_TRACE_ERROR: MQTTASYNC_TRACE_LEVELS = 5;
pub const MQTTASYNC_TRACE_LEVELS_MQTTASYNC_TRACE_SEVERE: MQTTASYNC_TRACE_LEVELS = 6;
pub const MQTTASYNC_TRACE_LEVELS_MQTTASYNC_TRACE_FATAL: MQTTASYNC_TRACE_LEVELS = 7;
pub type MQTTASYNC_TRACE_LEVELS = ::std::os::raw::c_uint;
extern "C" {
    #[doc = " This function sets the level of trace information which will be"]
    #[doc = " returned in the trace callback."]
    #[doc = " @param level the trace level required"]
    pub fn MQTTAsync_setTraceLevel(level: MQTTASYNC_TRACE_LEVELS);
}
#[doc = " This is a callback function prototype which must be implemented if you want"]
#[doc = " to receive trace information. Do not invoke any other Paho API calls in this"]
#[doc = " callback function - unpredictable behavior may result."]
#[doc = " @param level the trace level of the message returned"]
#[doc = " @param message the trace message.  This is a pointer to a static buffer which"]
#[doc = " will be overwritten on each call.  You must copy the data if you want to keep"]
#[doc = " it for later."]
pub type MQTTAsync_traceCallback = ::std::option::Option<
    unsafe extern "C" fn(level: MQTTASYNC_TRACE_LEVELS, message: *mut ::std::os::raw::c_char),
>;
extern "C" {
    #[doc = " This function sets the trace callback if needed.  If set to NULL,"]
    #[doc = " no trace information will be returned.  The default trace level is"]
    #[doc = " MQTTASYNC_TRACE_MINIMUM."]
    #[doc = " @param callback a pointer to the function which will handle the trace information"]
    pub fn MQTTAsync_setTraceCallback(callback: MQTTAsync_traceCallback);
}
extern "C" {
    #[doc = " This function returns version information about the library."]
    #[doc = " no trace information will be returned.  The default trace level is"]
    #[doc = " MQTTASYNC_TRACE_MINIMUM"]
    #[doc = " @return an array of strings describing the library.  The last entry is a NULL pointer."]
    pub fn MQTTAsync_getVersionInfo() -> *mut MQTTAsync_nameValue;
}
extern "C" {
    #[doc = " Returns a pointer to a string representation of the error code, or NULL."]
    #[doc = " Do not free after use. Returns NULL if the error code is unknown."]
    #[doc = " @param code the MQTTASYNC_ return code."]
    #[doc = " @return a static string representation of the error code."]
    pub fn MQTTAsync_strerror(code: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
pub type __builtin_va_list = [__va_list_tag; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __va_list_tag {
    pub gp_offset: ::std::os::raw::c_uint,
    pub fp_offset: ::std::os::raw::c_uint,
    pub overflow_arg_area: *mut ::std::os::raw::c_void,
    pub reg_save_area: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout___va_list_tag() {
    assert_eq!(
        ::std::mem::size_of::<__va_list_tag>(),
        24usize,
        concat!("Size of: ", stringify!(__va_list_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<__va_list_tag>(),
        8usize,
        concat!("Alignment of ", stringify!(__va_list_tag))
    );
    fn test_field_gp_offset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__va_list_tag>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gp_offset) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__va_list_tag),
                "::",
                stringify!(gp_offset)
            )
        );
    }
    test_field_gp_offset();
    fn test_field_fp_offset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__va_list_tag>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fp_offset) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(__va_list_tag),
                "::",
                stringify!(fp_offset)
            )
        );
    }
    test_field_fp_offset();
    fn test_field_overflow_arg_area() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__va_list_tag>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).overflow_arg_area) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(__va_list_tag),
                "::",
                stringify!(overflow_arg_area)
            )
        );
    }
    test_field_overflow_arg_area();
    fn test_field_reg_save_area() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__va_list_tag>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).reg_save_area) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(__va_list_tag),
                "::",
                stringify!(reg_save_area)
            )
        );
    }
    test_field_reg_save_area();
}
